config.org
#+EXPORT_FILE_NAME: readme
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Preamble
This is my private DOOM emacs configuration. It is tangled from ~config.org~ to ~config.el~
and is exported to ~readme.org~ with =,e O o= to render in the githup repo.
It is also rendered to HTML thanks to [[https://github.com/fniessen/org-html-themes][org-html-themes]] with =,e h h= .

NOTE: the code blocks in the sections marked with TODO are excluded from being tangled in my ~config.el~ file.

** Username and e-mail:
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Luca Cambiaghi"
      user-mail-address "luca.cambiaghi@me.com")
#+END_SRC
** Better defaults
#+BEGIN_SRC emacs-lisp
(setq-default
 uniquify-buffer-name-style 'forward              ; Uniquify buffer names
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      ;; auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      inhibit-compacting-font-caches t)           ; When there are lots of glyphs, keep them in memory

(delete-selection-mode 1)                         ; Replace selection when inserting text
;; (global-subword-mode 1)                           ; Iterate through CamelCase words
(setq +evil-want-o/O-to-continue-comments nil)
#+END_SRC
* Keybindings
** Auto unbind
Let's have ~general~ auto-unbind keys:
#+BEGIN_SRC emacs-lisp
(general-auto-unbind-keys)
#+END_SRC
