readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-09 Wed 22:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Luca Cambiaghi" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org231ec7a">1. Preamble</a>
<ul>
<li><a href="#orgbb642bc">1.1. Username and e-mail:</a></li>
<li><a href="#orgab96c82">1.2. Better defaults</a></li>
</ul>
</li>
<li><a href="#org096f82a">2. Keybindings</a>
<ul>
<li><a href="#org3a9bfcf">2.1. Auto unbind</a></li>
<li><a href="#org16ff5e6">2.2. spacemacs-like</a></li>
<li><a href="#org0700766">2.3. evil multiedit</a></li>
</ul>
</li>
<li><a href="#org2b2b8df">3. User Interface</a>
<ul>
<li><a href="#org4c511ae">3.1. Turn off line numbers</a></li>
<li><a href="#org5366d09">3.2. Font and font size:</a></li>
<li><a href="#orgd80276e">3.3. which-key delay</a></li>
<li><a href="#orgb394148">3.4. Customize modus themes</a></li>
<li><a href="#orgf1047da">3.5. Toggle modus themes at sunrise/sunset</a></li>
<li><a href="#org126fa45">3.6. Fancy splash image</a></li>
<li><a href="#orgc2fdef6">3.7. Centaur-tabs</a></li>
<li><a href="#org0842db4">3.8. Winum</a></li>
<li><a href="#org556cd36">3.9. Extra ligatures</a></li>
<li><a href="#org3e51d65">3.10. modeline</a>
<ul>
<li><a href="#org5aa0b37">3.10.1. Hide undesired info</a></li>
<li><a href="#org2f2f325">3.10.2. <span class="todo TODO">TODO</span> Show battery and time</a></li>
</ul>
</li>
<li><a href="#org04e8bf0">3.11. <span class="todo TODO">TODO</span> Split window and move to it</a></li>
<li><a href="#org32324fc">3.12. <span class="todo TODO">TODO</span> Emacs tree sitter</a></li>
<li><a href="#org61f0eea">3.13. Toggle centered cursor</a></li>
<li><a href="#org41b2cd4">3.14. <span class="todo TODO">TODO</span> Startup windows</a></li>
<li><a href="#org8f62ac2">3.15. <span class="todo TODO">TODO</span> Elegant emacs</a></li>
<li><a href="#org6062414">3.16. Prescient + selectrum + consult</a></li>
</ul>
</li>
<li><a href="#orge65ad57">4. Magit</a></li>
<li><a href="#org0c495d8">5. Company</a>
<ul>
<li><a href="#org17a8da7">5.1. Delay, prefix length</a></li>
<li><a href="#org6deab02">5.2. Disable tab</a></li>
<li><a href="#org22d5762">5.3. Show yasnippets as company suggestions</a></li>
</ul>
</li>
<li><a href="#orgf673fc2">6. Org</a>
<ul>
<li><a href="#orgc275295">6.1. Better defaults</a></li>
<li><a href="#org2b87cf7">6.2. Capture templates</a></li>
<li><a href="#org01d2227">6.3. Prettify bullets</a></li>
<li><a href="#orgab8d884">6.4. Org agenda popup</a></li>
<li><a href="#orgd01868a">6.5. ox-ipynb</a></li>
<li><a href="#org64bdc08">6.6. Org babel clojure</a></li>
<li><a href="#orga0ee74c">6.7. <span class="todo TODO">TODO</span> Reveal</a></li>
<li><a href="#org40e329c">6.8. org-cv</a></li>
<li><a href="#org82a3396">6.9. Use xelatex</a></li>
<li><a href="#org2bf42d8">6.10. HTML export does not fail when org links are present</a></li>
<li><a href="#org4ed19b9">6.11. <span class="todo TODO">TODO</span> org-tree-slide</a></li>
</ul>
</li>
<li><a href="#orgfb3d2f9">7. emacs-jupyter</a>
<ul>
<li><a href="#org208d4cd">7.1. Org default header arguments:</a></li>
<li><a href="#orgcad939e">7.2. Key bindings:</a></li>
<li><a href="#org313da6f">7.3. Popups</a></li>
<li><a href="#org0edb322">7.4. <span class="todo TODO">TODO</span> Library of babel</a></li>
<li><a href="#org7341486">7.5. Eval handler</a></li>
<li><a href="#org5219b17">7.6. Set REPL handler</a></li>
<li><a href="#org08fbda8">7.7. <span class="todo TODO">TODO</span> Use overlays</a></li>
<li><a href="#org61d395f">7.8. Long outputs</a></li>
<li><a href="#org7cc258d">7.9. Fix zmq keywords</a></li>
<li><a href="#orgbae892b">7.10. <span class="todo TODO">TODO</span> Unmap org-metadown</a></li>
<li><a href="#org6903099">7.11. <span class="todo TODO">TODO</span> scimax utilities</a></li>
</ul>
</li>
<li><a href="#org28ff361">8. Python</a>
<ul>
<li><a href="#orgeb319ec">8.1. REPL</a>
<ul>
<li><a href="#orgd7c3f98">8.1.1. virtualenv executable</a></li>
<li><a href="#org51eeec8">8.1.2. Silence warnings when opening REPL</a></li>
<li><a href="#orgedcd5a0">8.1.3. Ignore popup rule</a></li>
<li><a href="#org1b0d688">8.1.4. Disable native completion</a></li>
</ul>
</li>
<li><a href="#org4eb1ecf">8.2. LSP</a>
<ul>
<li><a href="#org93c5d76">8.2.1. Use pyright</a></li>
<li><a href="#orge94fbae">8.2.2. Don&rsquo;t guess project root</a></li>
<li><a href="#org19ec5de">8.2.3. Increase bytes read from subprocess</a></li>
<li><a href="#orge108217">8.2.4. lsp-help popup</a></li>
<li><a href="#org0553640">8.2.5. Disable lsp flycheck checker and use flake8</a></li>
<li><a href="#org9ceaa6d">8.2.6. UI</a></li>
<li><a href="#org1827c2f">8.2.7. Don&rsquo;t restart on exit</a></li>
<li><a href="#org891d68a">8.2.8. <span class="todo TODO">TODO</span> Eglot</a></li>
</ul>
</li>
<li><a href="#org9998b22">8.3. Pytest</a></li>
<li><a href="#orgb27d3bc">8.4. dap-mode</a>
<ul>
<li><a href="#orgedeec01">8.4.1. dap configure windows</a></li>
<li><a href="#org3ec5319">8.4.2. Remove dap ui features</a></li>
<li><a href="#org926f6b9">8.4.3. Debug templates:</a></li>
<li><a href="#org76f378c">8.4.4. Debug test at point</a></li>
<li><a href="#org365f42f">8.4.5. virtualenv executable</a></li>
<li><a href="#org81679eb">8.4.6. Delete hap hydra bindings</a></li>
<li><a href="#orgc9e9f82">8.4.7. Bindings</a></li>
<li><a href="#org786d0bd">8.4.8. <span class="todo TODO">TODO</span> Use debugpy</a></li>
</ul>
</li>
<li><a href="#orgc4b9b51">8.5. emacs-ipython-notebook</a>
<ul>
<li><a href="#org1b36bee">8.5.1. Don&rsquo;t ignore <code>ein</code> buffers</a></li>
<li><a href="#org0115fc1">8.5.2. Bindings</a></li>
</ul>
</li>
<li><a href="#orgcec3a14">8.6. Dash docsets</a></li>
<li><a href="#org80a2eea">8.7. Compilation popup</a></li>
<li><a href="#org7d1566d">8.8. Disable venv in modeline</a></li>
</ul>
</li>
<li><a href="#org25ea4dd">9. R</a>
<ul>
<li><a href="#orgdd81e77">9.1. ESS console popup</a></li>
<li><a href="#orgfb1096c">9.2. Async eval</a></li>
<li><a href="#org158ea20">9.3. Syntax highlighting</a></li>
</ul>
</li>
<li><a href="#orgcba9ac6">10. Clojure</a>
<ul>
<li><a href="#org6889a80">10.1. Company keybindings</a></li>
<li><a href="#org047fd3e">10.2. REPL keybindings</a></li>
<li><a href="#orge926ee9">10.3. Cleverparens</a></li>
<li><a href="#orgceb926e">10.4. Aggressive indent</a></li>
<li><a href="#org13d2ff0">10.5. Cleverparens keybindings</a></li>
<li><a href="#org9f5fffa">10.6. nREPL timeout</a></li>
<li><a href="#org6edc9f2">10.7. Align vertically automatically</a></li>
<li><a href="#orgf0b5c9b">10.8. Cider keybindings</a></li>
<li><a href="#org026ae78">10.9. <span class="todo TODO">TODO</span> evil lisp state</a></li>
<li><a href="#org51e5189">10.10. <span class="todo TODO">TODO</span> Miracle</a></li>
<li><a href="#orgedca8df">10.11. cider-doc while developing Unity</a></li>
</ul>
</li>
<li><a href="#orgc8bd17f">11. Shell</a>
<ul>
<li><a href="#orgb5b304a">11.1. Async Shell command</a></li>
<li><a href="#orgdd43c83">11.2. Async command and vterm popups</a></li>
<li><a href="#org8d7e8a8">11.3. Eshell popup to the right</a></li>
</ul>
</li>
<li><a href="#org16a454d">12. <span class="todo TODO">TODO</span> Webkit</a></li>
</ul>
</div>
</div>

<div id="outline-container-org231ec7a" class="outline-2">
<h2 id="org231ec7a"><span class="section-number-2">1</span> Preamble</h2>
<div class="outline-text-2" id="text-1">
<p>
This is my private DOOM emacs configuration. It is tangled from <code>config.org</code> to <code>config.el</code>
and is exported to <code>readme.org</code> with <code>,e O o</code> to render in the githup repo.
It is also rendered to HTML thanks to <a href="https://github.com/fniessen/org-html-themes">org-html-themes</a> with <code>,e h h</code> .
</p>

<p>
NOTE: the code blocks in the sections marked with TODO are excluded from being tangled in my <code>config.el</code> file.
</p>
</div>

<div id="outline-container-orgbb642bc" class="outline-3">
<h3 id="orgbb642bc"><span class="section-number-3">1.1</span> Username and e-mail:</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">user-full-name</span> <span style="color: #79a8ff;">"Luca Cambiaghi"</span>
      <span style="color: #00d3d0;">user-mail-address</span> <span style="color: #79a8ff;">"luca.cambiaghi@me.com"</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab96c82" class="outline-3">
<h3 id="orgab96c82"><span class="section-number-3">1.2</span> Better defaults</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq-default</span>
 <span style="color: #00d3d0;">uniquify-buffer-name-style</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">forward</span>              <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">Uniquify buffer names</span>
 <span style="color: #00d3d0;">window-combination-resize</span> t                      <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">take new window space from all other windows (not just current)</span>
 <span style="color: #00d3d0;">x-stretch-cursor</span> t<span style="color: #00cd68;">)</span>                              <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">Stretch cursor to the glyph width</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">undo-limit</span> <span style="color: #00bcff;">80000000</span>                         <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">Raise undo-limit to 80Mb</span>
      <span style="color: #00d3d0;">evil-want-fine-undo</span> t                       <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">By default while in insert all changes are one big blob. Be more granular</span>
      <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">auto-save-default t                         ; Nobody likes to loose work, I certainly don't</span>
      <span style="color: #00d3d0;">inhibit-compacting-font-caches</span> t<span style="color: #00cd68;">)</span>           <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">When there are lots of glyphs, keep them in memory</span>

<span style="color: #00cd68;">(</span><span style="color: #00d3d0;">delete-selection-mode</span> <span style="color: #00bcff;">1</span><span style="color: #00cd68;">)</span>                         <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">Replace selection when inserting text</span>
<span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(global-subword-mode 1)                           ; Iterate through CamelCase words</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">+evil-want-o/O-to-continue-comments</span> nil<span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org096f82a" class="outline-2">
<h2 id="org096f82a"><span class="section-number-2">2</span> Keybindings</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3a9bfcf" class="outline-3">
<h3 id="org3a9bfcf"><span class="section-number-3">2.1</span> Auto unbind</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Let&rsquo;s have <code>general</code> auto-unbind keys:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #00bcff;">general-auto-unbind-keys</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
