config.org
** spacemacs-like
We then remap some of the bindings (inspired by [[https://github.com/jsmestad/dfiles/blob/master/.doom.d/%2Bbindings.el#L496-L854][bindings.el]]).
#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "M-x"                   :n "SPC" #'counsel-M-x

      :desc "ivy resume" :n ":" #'ivy-resume
      :desc "Async shell command"   :n "!"   #'async-shell-command
      :desc "Toggle eshell"         :n "'"   #'+eshell/toggle
      :desc "Open dir in iTerm" :n "oi" #'+macos/open-in-iterm

      (:desc "windows" :prefix "w"
        :desc "popup raise" :n "p" #'+popup/raise)

      (:desc "project" :prefix "p"
        :desc "Eshell"               :n "'" #'projectile-run-eshell
        :desc "Terminal" :n "t" #'projectile-run-vterm ))

#+END_SRC
** evil multiedit
Add this keybinding because external keyboard inputs delta when pressing ~M-d~.
Bind command to restrict matches to highlighted region as ~RET~ does not really work.
#+BEGIN_SRC emacs-lisp
(define-key evil-normal-state-map (kbd "s-d") #'evil-multiedit-match-symbol-and-next)

(after! evil-multiedit
  (setq evil-multiedit-follow-matches t)
  (map! :v "zD" #'evil-multiedit-toggle-or-restrict-region))
#+END_SRC

* User Interface
** Turn off line numbers
#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type nil)
#+END_SRC
** Font and font size:
Toggle ~big mode~ with =SPC t b=
#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "Menlo" :size 16)
      doom-big-font (font-spec :family "Menlo" :size 20))
#+END_SRC
** which-key delay
#+BEGIN_SRC emacs-lisp
(after! which-key
    (setq which-key-idle-delay 0.5))
#+END_SRC

