readme.html
<div id="outline-container-org16ff5e6" class="outline-3">
<h3 id="org16ff5e6"><span class="section-number-3">2.2</span> spacemacs-like</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We then remap some of the bindings (inspired by <a href="https://github.com/jsmestad/dfiles/blob/master/.doom.d/%2Bbindings.el#L496-L854">bindings.el</a>).
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:leader</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"M-x"</span>                   <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"SPC"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">counsel-M-x</span>

      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"ivy resume"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">":"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">ivy-resume</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Async shell command"</span>   <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"!"</span>   <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">async-shell-command</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Toggle eshell"</span>         <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"'"</span>   <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">+eshell/toggle</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Open dir in iTerm"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"oi"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">+macos/open-in-iterm</span>

      <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"windows"</span> <span style="color: #f78fe7; font-weight: bold;">:prefix</span> <span style="color: #79a8ff;">"w"</span>
        <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"popup raise"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"p"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">+popup/raise</span><span style="color: #b6a0ff;">)</span>

      <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"project"</span> <span style="color: #f78fe7; font-weight: bold;">:prefix</span> <span style="color: #79a8ff;">"p"</span>
        <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Eshell"</span>               <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"'"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">projectile-run-eshell</span>
        <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Terminal"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"t"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">projectile-run-vterm</span> <span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org0700766" class="outline-3">
<h3 id="org0700766"><span class="section-number-3">2.3</span> evil multiedit</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Add this keybinding because external keyboard inputs delta when pressing <code>M-d</code>.
Bind command to restrict matches to highlighted region as <code>RET</code> does not really work.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #00bcff;">define-key</span> <span style="color: #00d3d0;">evil-normal-state-map</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">kbd</span> <span style="color: #79a8ff;">"s-d"</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">evil-multiedit-match-symbol-and-next</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> evil-multiedit
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> evil-multiedit-follow-matches t<span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:v</span> <span style="color: #79a8ff;">"zD"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">evil-multiedit-toggle-or-restrict-region</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2b2b8df" class="outline-2">
<h2 id="org2b2b8df"><span class="section-number-2">3</span> User Interface</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4c511ae" class="outline-3">
<h3 id="org4c511ae"><span class="section-number-3">3.1</span> Turn off line numbers</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">display-line-numbers-type</span> nil<span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5366d09" class="outline-3">
<h3 id="org5366d09"><span class="section-number-3">3.2</span> Font and font size:</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Toggle <code>big mode</code> with <code>SPC t b</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">doom-font</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">font-spec</span> <span style="color: #f78fe7; font-weight: bold;">:family</span> <span style="color: #79a8ff;">"Menlo"</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">16</span><span style="color: #b6a0ff;">)</span>
      <span style="color: #00d3d0;">doom-big-font</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">font-spec</span> <span style="color: #f78fe7; font-weight: bold;">:family</span> <span style="color: #79a8ff;">"Menlo"</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">20</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd80276e" class="outline-3">
<h3 id="orgd80276e"><span class="section-number-3">3.3</span> which-key delay</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> which-key
    <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">which-key-idle-delay</span> <span style="color: #00bcff;">0.5</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
