readme.html

<div id="outline-container-orgb394148" class="outline-3">
<h3 id="orgb394148"><span class="section-number-3">3.4</span> Customize modus themes</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defmacro</span> <span style="color: #feacd0;">modus-themes-format-sexp</span> <span style="color: #b6a0ff;">(</span>sexp <span style="color: #f78fe7;">&amp;rest</span> objects<span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff; font-weight: bold;">`</span><span style="color: #b6a0ff;">(</span>eval <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">read</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">format</span> ,<span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">format</span> <span style="color: #79a8ff;">"%S"</span> sexp<span style="color: #b6a0ff;">)</span> ,@objects<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">dolist</span> <span style="color: #b6a0ff;">(</span>theme <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"operandi"</span> <span style="color: #79a8ff;">"vivendi"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">modus-themes-format-sexp</span>
   <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">modus-%1$s-theme-load</span> <span style="color: #00cd68;">()</span>
     <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> modus-%1$s-theme-slanted-constructs t
           modus-%1$s-theme-bold-constructs t
           modus-%1$s-theme-fringes <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">subtle</span> <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">{nil,'subtle,'intense}</span>
           modus-%1$s-theme-mode-line <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">3d</span> <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">{nil,'3d,'moody}</span>
           modus-%1$s-theme-faint-syntax nil
           modus-%1$s-theme-intense-hl-line nil
           modus-%1$s-theme-intense-paren-match nil
           modus-%1$s-theme-no-link-underline t
           modus-%1$s-theme-no-mixed-fonts nil
           modus-%1$s-theme-prompts nil <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">{nil,'subtle,'intense}</span>
           modus-%1$s-theme-completions <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">moderate</span> <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">{nil,'moderate,'opinionated}</span>
           modus-%1$s-theme-diffs nil <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">{nil,'desaturated,'fg-only}</span>
           modus-%1$s-theme-org-blocks <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">greyscale</span> <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">{nil,'greyscale,'rainbow}</span>
           modus-%1$s-theme-headings  <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">Read further below in the manual for this one</span>
           <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">1</span> . line<span style="color: #6ae4b9;">)</span>
             <span style="color: #6ae4b9;">(</span>t . rainbow-line-no-bold<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
           modus-%1$s-theme-variable-pitch-headings t
           modus-%1$s-theme-scale-headings t
           modus-%1$s-theme-scale-1 <span style="color: #00bcff;">1.1</span>
           modus-%1$s-theme-scale-2 <span style="color: #00bcff;">1.15</span>
           modus-%1$s-theme-scale-3 <span style="color: #00bcff;">1.21</span>
           modus-%1$s-theme-scale-4 <span style="color: #00bcff;">1.27</span>
           modus-%1$s-theme-scale-5 <span style="color: #00bcff;">1.33</span><span style="color: #00cd68;">)</span>
     <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">doom-theme</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">modus-%1$s</span><span style="color: #00cd68;">)</span>
     <span style="color: #00cd68;">(</span><span style="color: #feacd0;">doom/reload-theme</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
   theme<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">modus-operandi-theme-override-colors-alist</span>
            <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-main"</span> . <span style="color: #79a8ff;">"#fefcf4"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-dim"</span> . <span style="color: #79a8ff;">"#faf6ef"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-alt"</span> . <span style="color: #79a8ff;">"#f7efe5"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-hl-line"</span> . <span style="color: #79a8ff;">"#f4f0e3"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-active"</span> . <span style="color: #79a8ff;">"#e8dfd1"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-inactive"</span> . <span style="color: #79a8ff;">"#f6ece5"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-region"</span> . <span style="color: #79a8ff;">"#c6bab1"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-header"</span> . <span style="color: #79a8ff;">"#ede3e0"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-tab-bar"</span> . <span style="color: #79a8ff;">"#dcd3d3"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-tab-active"</span> . <span style="color: #79a8ff;">"#fdf6eb"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-tab-inactive"</span> . <span style="color: #79a8ff;">"#c8bab8"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"fg-unfocused"</span> . <span style="color: #79a8ff;">"#55556f"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
            <span style="color: #00d3d0;">modus-vivendi-theme-override-colors-alist</span>
            <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-main"</span> . <span style="color: #79a8ff;">"#100b17"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-dim"</span> . <span style="color: #79a8ff;">"#161129"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-alt"</span> . <span style="color: #79a8ff;">"#181732"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-hl-line"</span> . <span style="color: #79a8ff;">"#191628"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-active"</span> . <span style="color: #79a8ff;">"#282e46"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-inactive"</span> . <span style="color: #79a8ff;">"#1a1e39"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-region"</span> . <span style="color: #79a8ff;">"#393a53"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-header"</span> . <span style="color: #79a8ff;">"#202037"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-tab-bar"</span> . <span style="color: #79a8ff;">"#262b41"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-tab-active"</span> . <span style="color: #79a8ff;">"#120f18"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"bg-tab-inactive"</span> . <span style="color: #79a8ff;">"#3a3a5a"</span><span style="color: #6ae4b9;">)</span>
              <span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"fg-unfocused"</span> . <span style="color: #79a8ff;">"#9a9aab"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
            <span style="color: #00d3d0;">modus-operandi-theme-intense-paren-match</span> t
            <span style="color: #00d3d0;">modus-operandi-theme-distinct-org-blocks</span> t<span style="color: #00cd68;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf1047da" class="outline-3">
<h3 id="orgf1047da"><span class="section-number-3">3.5</span> Toggle modus themes at sunrise/sunset</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">Light for the day</span>
<span style="color: #00cd68;">(</span><span style="color: #00bcff;">run-at-time</span> <span style="color: #79a8ff;">"07:00"</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">*</span> <span style="color: #00bcff;">60</span> <span style="color: #00bcff;">60</span> <span style="color: #00bcff;">24</span><span style="color: #b6a0ff;">)</span>
             <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">lambda</span> <span style="color: #6ae4b9;">()</span>
               <span style="color: #6ae4b9;">(</span><span style="color: #feacd0;">modus-operandi-theme-load</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Dark for the night</span>
<span style="color: #00cd68;">(</span><span style="color: #00bcff;">run-at-time</span> <span style="color: #79a8ff;">"15:00"</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">*</span> <span style="color: #00bcff;">60</span> <span style="color: #00bcff;">60</span> <span style="color: #00bcff;">24</span><span style="color: #b6a0ff;">)</span>
             <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">lambda</span> <span style="color: #6ae4b9;">()</span>
               <span style="color: #6ae4b9;">(</span><span style="color: #feacd0;">modus-vivendi-theme-load</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
