config.org
** Fancy splash image
#+BEGIN_SRC emacs-lisp
(setq +doom-dashboard-banner-file
      (expand-file-name "splash-images/black-hole2.png" doom-private-dir))
#+END_SRC
** Centaur-tabs
#+BEGIN_SRC emacs-lisp
(after! centaur-tabs
  (setq centaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker "M"
        centaur-tabs-cycle-scope 'tabs
        centaur-tabs-set-close-button nil)
  (centaur-tabs-group-by-projectile-project))
#+END_SRC
** Winum
note: insteadf of using =SPC 0=, use =SPC w h= to access its window. In general,
use those keys!
#+BEGIN_SRC emacs-lisp
(after! winum
    (map! (:when (featurep! :ui window-select)
            :leader
            :n "1" #'winum-select-window-1
            :n "2" #'winum-select-window-2
            :n "3" #'winum-select-window-3
        )))
#+END_SRC
** Extra ligatures
#+BEGIN_SRC emacs-lisp
(setq +ligatures-extras-in-modes
      '(not special-mode comint-mode eshell-mode term-mode vterm-mode python-mode))
;; (setq +ligatures-in-modes '(org-mode))
#+END_SRC
** modeline
*** Hide undesired info
#+BEGIN_SRC emacs-lisp
(after! doom-modeline
  (setq doom-modeline-buffer-encoding nil)
  (setq doom-modeline-env-enable-python nil))

(after! lsp-mode
  (setq lsp-modeline-diagnostics-enable nil))
#+END_SRC
*** TODO Show battery and time
#+BEGIN_SRC emacs-lisp :tangle no
(after! doom-modeline
    (setq display-time-default-load-average nil)      ; don't show load average
    (display-time-mode 1)                             ; Enable time in the mode-line
    (display-battery-mode 1))                          ; On laptops it's nice to know how much power you have
#+END_SRC
** TODO Split window and move to it
#+BEGIN_SRC emacs-lisp :tangle no
(setq evil-split-window-below t
      evil-vsplit-window-right t)
#+END_SRC
** TODO Emacs tree sitter
After ~doom sync~ you should run ~tree-sitter-install-grammars~ (maybe?).
Disabled because of a bug with ~evil-multiedit~.
#+BEGIN_SRC emacs-lisp :tangle no
(use-package tree-sitter
  :after python-mode
  :defer t
  :config
  (after! tree-sitter
    (require 'tree-sitter)
    (require 'tree-sitter-langs)
    (require 'tree-sitter-hl)
    (add-hook 'python-mode-hook #'tree-sitter-hl-mode)
    )
  )
#+END_SRC
** Toggle centered cursor
#+BEGIN_SRC emacs-lisp
(use-package! centered-cursor-mode
  :defer t
  :config
  (map! :leader
        :desc "toggle centered cursor"                   :n "t-" (λ! () (interactive) (centered-cursor-mode 'toggle))
        ))

#+END_SRC
