readme.html

<div id="outline-container-org126fa45" class="outline-3">
<h3 id="org126fa45"><span class="section-number-3">3.6</span> Fancy splash image</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">+doom-dashboard-banner-file</span>
      <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">expand-file-name</span> <span style="color: #79a8ff;">"splash-images/black-hole2.png"</span> <span style="color: #00d3d0;">doom-private-dir</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc2fdef6" class="outline-3">
<h3 id="orgc2fdef6"><span class="section-number-3">3.7</span> Centaur-tabs</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> centaur-tabs
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">centaur-tabs-set-modified-marker</span> t
        <span style="color: #00d3d0;">centaur-tabs-modified-marker</span> <span style="color: #79a8ff;">"M"</span>
        <span style="color: #00d3d0;">centaur-tabs-cycle-scope</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">tabs</span>
        <span style="color: #00d3d0;">centaur-tabs-set-close-button</span> nil<span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">centaur-tabs-group-by-projectile-project</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0842db4" class="outline-3">
<h3 id="org0842db4"><span class="section-number-3">3.8</span> Winum</h3>
<div class="outline-text-3" id="text-3-8">
<p>
note: insteadf of using <code>SPC 0</code>, use <code>SPC w h</code> to access its window. In general,
use those keys!
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> winum
    <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #6ae4b9;">(</span><span style="color: #f78fe7; font-weight: bold;">:when</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">featurep!</span> <span style="color: #f78fe7; font-weight: bold;">:ui</span> window-select<span style="color: #00cd68;">)</span>
            <span style="color: #f78fe7; font-weight: bold;">:leader</span>
            <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"1"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">winum-select-window-1</span>
            <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"2"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">winum-select-window-2</span>
            <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"3"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">winum-select-window-3</span>
        <span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org556cd36" class="outline-3">
<h3 id="org556cd36"><span class="section-number-3">3.9</span> Extra ligatures</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">+ligatures-extras-in-modes</span>
      <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #b6a0ff;">(</span>not special-mode comint-mode eshell-mode term-mode vterm-mode python-mode<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
<span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq +ligatures-in-modes '(org-mode))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e51d65" class="outline-3">
<h3 id="org3e51d65"><span class="section-number-3">3.10</span> modeline</h3>
<div class="outline-text-3" id="text-3-10">
</div>
<div id="outline-container-org5aa0b37" class="outline-4">
<h4 id="org5aa0b37"><span class="section-number-4">3.10.1</span> Hide undesired info</h4>
<div class="outline-text-4" id="text-3-10-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> doom-modeline
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">doom-modeline-buffer-encoding</span> nil<span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">doom-modeline-env-enable-python</span> nil<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> <span style="color: #00d3d0;">lsp-mode</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">lsp-modeline-diagnostics-enable</span> nil<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2f2f325" class="outline-4">
<h4 id="org2f2f325"><span class="section-number-4">3.10.2</span> <span class="todo TODO">TODO</span> Show battery and time</h4>
<div class="outline-text-4" id="text-3-10-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> doom-modeline
    <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> display-time-default-load-average nil<span style="color: #b6a0ff;">)</span>      <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">don't show load average</span>
    <span style="color: #b6a0ff;">(</span><span style="color: #00d3d0;">display-time-mode</span> <span style="color: #00bcff;">1</span><span style="color: #b6a0ff;">)</span>                             <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">Enable time in the mode-line</span>
    <span style="color: #b6a0ff;">(</span><span style="color: #00d3d0;">display-battery-mode</span> <span style="color: #00bcff;">1</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>                          <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">On laptops it's nice to know how much power you have</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org04e8bf0" class="outline-3">
<h3 id="org04e8bf0"><span class="section-number-3">3.11</span> <span class="todo TODO">TODO</span> Split window and move to it</h3>
<div class="outline-text-3" id="text-3-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">evil-split-window-below</span> t
      <span style="color: #00d3d0;">evil-vsplit-window-right</span> t<span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org32324fc" class="outline-3">
<h3 id="org32324fc"><span class="section-number-3">3.12</span> <span class="todo TODO">TODO</span> Emacs tree sitter</h3>
<div class="outline-text-3" id="text-3-12">
<p>
After <code>doom sync</code> you should run <code>tree-sitter-install-grammars</code> (maybe?).
Disabled because of a bug with <code>evil-multiedit</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package</span> tree-sitter
  <span style="color: #f78fe7; font-weight: bold;">:after</span> python-mode
  <span style="color: #f78fe7; font-weight: bold;">:defer</span> t
  <span style="color: #f78fe7; font-weight: bold;">:config</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> tree-sitter
    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">require</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">tree-sitter</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">require</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">tree-sitter-langs</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">require</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">tree-sitter-hl</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">add-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">python-mode-hook</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">tree-sitter-hl-mode</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #b6a0ff;">)</span>
  <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org61f0eea" class="outline-3">
<h3 id="org61f0eea"><span class="section-number-3">3.13</span> Toggle centered cursor</h3>
<div class="outline-text-3" id="text-3-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package!</span> centered-cursor-mode
  <span style="color: #f78fe7; font-weight: bold;">:defer</span> t
  <span style="color: #f78fe7; font-weight: bold;">:config</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:leader</span>
        <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"toggle centered cursor"</span>                   <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"t-"</span> <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">&#955;!</span> <span style="color: #00cd68;">()</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span><span style="color: #00cd68;">)</span> <span style="color: #00cd68;">(</span><span style="color: #feacd0;">centered-cursor-mode</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">toggle</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
        <span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

</pre>
</div>
</div>
</div>
