config.org
** TODO Startup windows
#+BEGIN_SRC emacs-lisp :tangle no
(defun my/startup-window-setup ()
  "Called by emacs-startup-hook to set up my initial window configuration."

  (split-window-right)
  (other-window 1)
  (find-file "~/txt/todo.org")
  (other-window 1))

(add-hook 'emacs-startup-hook #'my-default-window-setup)
#+END_SRC

** TODO Elegant emacs
Need to disable ~centaur-tabs-mode~
#+BEGIN_SRC emacs-lisp :tangle no
(defun my/enable-elegant ()
  "Enable elegant-emacs theme"
  (interactive)
  (require 'elegance)
  (require 'sanity)
  ;; (setq doom-theme 'elegance)
  ;; (add-hook! 'doom-load-theme-hook #'elegance-light)
  ;; (doom/reload-theme)
  )
#+END_SRC
** Prescient + selectrum + consult
#+BEGIN_SRC emacs-lisp :tangle no
(use-package! selectrum
  :commands (selectrum-mode)
  :config
  (map! :map selectrum-minibuffer-map
        :in "C-j" #'selectrum-next-candidate
        ))

(use-package! selectrum-prescient
  :when (featurep! +prescient)
  :commands (selectrum-prescient-mode))

(use-package! company-prescient
  :commands (company-prescient-mode 1))

(add-hook! '(doom-first-input-hook)
  (selectrum-mode +1)
  (when (featurep! +prescient)
    (selectrum-prescient-mode +1)
    (company-prescient-mode 1)
    (prescient-persist-mode +1)))

Projectile defaults to forcing icomplete instead of completing-read
(after! projectile
  (setq projectile-completion-system 'default))

(use-package consult
  ;; Replace bindings
  ;; :bind (("C-c o" . consult-outline)
  ;;        ("C-x b" . consult-buffer)
  ;;        ("M-g o" . consult-outline) ;; "M-s o" is a good alternative
  ;;        ("M-g l" . consult-line)    ;; "M-s l" is a good alternative
  ;;        ("M-s m" . consult-multi-occur)
  ;;        ("M-y" . consult-yank-pop)

  :init

  ;; Replace functions (consult-multi-occur is a drop-in replacement)
  (fset 'multi-occur #'consult-multi-occur)

  :config

  (map! :leader :desc "consult line" :n "ss" #'consult-line
        :desc "M-x"                   :n "SPC" #'execute-extended-command
        :desc "consult line" :n "ss" #'consult-line
        )

  ;; Enable richer annotations during completion
  ;; Works only with selectrum as of now.
  (consult-annotate-mode)

  ;; Enable richer annotations for M-x.
  ;; I have this disabled by default, since I don't want to be flooded with information.
  ;; Annotations are only enabled by default for the describe-* class of functions.
  (add-to-list 'consult-annotate-commands
               '(execute-extended-command . consult-annotate-symbol))
  )

#+END_SRC

