readme.html
<div id="outline-container-org41b2cd4" class="outline-3">
<h3 id="org41b2cd4"><span class="section-number-3">3.14</span> <span class="todo TODO">TODO</span> Startup windows</h3>
<div class="outline-text-3" id="text-3-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">my/startup-window-setup</span> <span style="color: #b6a0ff;">()</span>
  <span style="color: #c6eaff; font-style: italic;">"Called by emacs-startup-hook to set up my initial window configuration."</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">split-window-right</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">other-window</span> <span style="color: #00bcff;">1</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">find-file</span> <span style="color: #79a8ff;">"~/txt/todo.org"</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">other-window</span> <span style="color: #00bcff;">1</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #00bcff;">add-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">emacs-startup-hook</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">my-default-window-setup</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f62ac2" class="outline-3">
<h3 id="org8f62ac2"><span class="section-number-3">3.15</span> <span class="todo TODO">TODO</span> Elegant emacs</h3>
<div class="outline-text-3" id="text-3-15">
<p>
Need to disable <code>centaur-tabs-mode</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">my/enable-elegant</span> <span style="color: #b6a0ff;">()</span>
  <span style="color: #c6eaff; font-style: italic;">"Enable elegant-emacs theme"</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">require</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">elegance</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">require</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">sanity</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq doom-theme 'elegance)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(add-hook! 'doom-load-theme-hook #'elegance-light)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(doom/reload-theme)</span>
  <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6062414" class="outline-3">
<h3 id="org6062414"><span class="section-number-3">3.16</span> Prescient + selectrum + consult</h3>
<div class="outline-text-3" id="text-3-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package!</span> selectrum
  <span style="color: #f78fe7; font-weight: bold;">:commands</span> <span style="color: #b6a0ff;">(</span>selectrum-mode<span style="color: #b6a0ff;">)</span>
  <span style="color: #f78fe7; font-weight: bold;">:config</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:map</span> selectrum-minibuffer-map
        <span style="color: #f78fe7; font-weight: bold;">:in</span> <span style="color: #79a8ff;">"C-j"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">selectrum-next-candidate</span>
        <span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package!</span> selectrum-prescient
  <span style="color: #f78fe7; font-weight: bold;">:when</span> <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">featurep!</span> +prescient<span style="color: #b6a0ff;">)</span>
  <span style="color: #f78fe7; font-weight: bold;">:commands</span> <span style="color: #b6a0ff;">(</span>selectrum-prescient-mode<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package!</span> company-prescient
  <span style="color: #f78fe7; font-weight: bold;">:commands</span> <span style="color: #b6a0ff;">(</span>company-prescient-mode <span style="color: #00bcff;">1</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">add-hook!</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #b6a0ff;">(</span><span style="color: #00d3d0;">doom-first-input-hook</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span>selectrum-mode <span style="color: #00bcff;">+1</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">when</span> <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">featurep!</span> +prescient<span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span>selectrum-prescient-mode <span style="color: #00bcff;">+1</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span>company-prescient-mode <span style="color: #00bcff;">1</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span>prescient-persist-mode <span style="color: #00bcff;">+1</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

Projectile defaults to forcing icomplete instead of completing-read
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> projectile
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">projectile-completion-system</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">default</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package</span> consult
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Replace bindings</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">:bind (("C-c o" . consult-outline)</span>
  <span style="color: #a8a8a8; font-style: italic;">;;        </span><span style="color: #a8a8a8; font-style: italic;">("C-x b" . consult-buffer)</span>
  <span style="color: #a8a8a8; font-style: italic;">;;        </span><span style="color: #a8a8a8; font-style: italic;">("M-g o" . consult-outline) ;; "M-s o" is a good alternative</span>
  <span style="color: #a8a8a8; font-style: italic;">;;        </span><span style="color: #a8a8a8; font-style: italic;">("M-g l" . consult-line)    ;; "M-s l" is a good alternative</span>
  <span style="color: #a8a8a8; font-style: italic;">;;        </span><span style="color: #a8a8a8; font-style: italic;">("M-s m" . consult-multi-occur)</span>
  <span style="color: #a8a8a8; font-style: italic;">;;        </span><span style="color: #a8a8a8; font-style: italic;">("M-y" . consult-yank-pop)</span>

  <span style="color: #f78fe7; font-weight: bold;">:init</span>

  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Replace functions (consult-multi-occur is a drop-in replacement)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">fset</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">multi-occur</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">consult-multi-occur</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #f78fe7; font-weight: bold;">:config</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:leader</span> <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"consult line"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"ss"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">consult-line</span>
        <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"M-x"</span>                   <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"SPC"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">execute-extended-command</span>
        <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"consult line"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"ss"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">consult-line</span>
        <span style="color: #b6a0ff;">)</span>

  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Enable richer annotations during completion</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Works only with selectrum as of now.</span>
  <span style="color: #b6a0ff;">(</span>consult-annotate-mode<span style="color: #b6a0ff;">)</span>

  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Enable richer annotations for M-x.</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">I have this disabled by default, since I don't want to be flooded with information.</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Annotations are only enabled by default for the describe-* class of functions.</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-to-list</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">consult-annotate-commands</span>
               <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span>execute-extended-command . consult-annotate-symbol<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #00cd68;">)</span>

</pre>
</div>
</div>
</div>
</div>
