config.org
* Magit
#+BEGIN_SRC emacs-lisp
(after! magit
  ;; (magit-wip-mode)
  (setq magit-repository-directories '(("~/git" . 2))
        magit-save-repository-buffers nil
        ;; Don't restore the wconf after quitting magit
        magit-inhibit-save-previous-winconf t
        magit-log-arguments '("--graph" "--decorate" "--color")
        ;; magit-delete-by-moving-to-trash nil
        git-commit-summary-max-length 120))
#+END_SRC
* Company
** Delay, prefix length
#+BEGIN_SRC emacs-lisp
(after! company
  (setq company-idle-delay 0
        company-minimum-prefix-length 1
        company-dabbrev-code-everywhere t
        company-dabbrev-code-other-buffers 'all))
;; company-quickhelp-delay 0.4)
#+END_SRC
** Disable tab
#+BEGIN_SRC emacs-lisp
(after! company
  (define-key! company-active-map
    "TAB"       nil
    [tab]       nil))
#+END_SRC

** Show yasnippets as company suggestions
#+BEGIN_SRC emacs-lisp
(after! company
  (defvar company-mode/enable-yas t
    "Enable yasnippet for all backends.")

  (defun company-mode/backend-with-yas (backend)
    (if (or (not company-mode/enable-yas) (and (listp backend) (member 'company-yasnippet backend)))
        backend
      (append (if (consp backend) backend (list backend))
              '(:with company-yasnippet))))

  (setq company-backends (mapcar #'company-mode/backend-with-yas company-backends)))
#+END_SRC

* Org
** Better defaults
#+BEGIN_SRC emacs-lisp
(after! org
(setq org-directory "~/Dropbox/org"
      org-image-actual-width nil
      +org-export-directory "~/Dropbox/org/export"
      org-default-notes-file "~/Dropbox/org/personal/inbox.org"
      org-id-locations-file "~/Dropbox/org/.orgids"
      ;; org-agenda-files (directory-files-recursively "~/dropbox/org/" "\\.org$")
      org-agenda-files '("~/dropbox/org/personal/inbox.org" "~/dropbox/org/personal/tasks.org" "~/dropbox/org/personal/birthdays.org")
      ;; org-export-in-background t
      org-catch-invisible-edits 'smart))
#+END_SRC
