readme.html

<div id="outline-container-orge65ad57" class="outline-2">
<h2 id="orge65ad57"><span class="section-number-2">4</span> Magit</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> magit
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(magit-wip-mode)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">magit-repository-directories</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"~/git"</span> . <span style="color: #00bcff;">2</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
        <span style="color: #00d3d0;">magit-save-repository-buffers</span> nil
        <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Don't restore the wconf after quitting magit</span>
        <span style="color: #00d3d0;">magit-inhibit-save-previous-winconf</span> t
        magit-log-arguments <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"--graph"</span> <span style="color: #79a8ff;">"--decorate"</span> <span style="color: #79a8ff;">"--color"</span><span style="color: #6ae4b9;">)</span>
        <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">magit-delete-by-moving-to-trash nil</span>
        <span style="color: #00d3d0;">git-commit-summary-max-length</span> <span style="color: #00bcff;">120</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c495d8" class="outline-2">
<h2 id="org0c495d8"><span class="section-number-2">5</span> Company</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org17a8da7" class="outline-3">
<h3 id="org17a8da7"><span class="section-number-3">5.1</span> Delay, prefix length</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> company
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">company-idle-delay</span> <span style="color: #00bcff;">0</span>
        <span style="color: #00d3d0;">company-minimum-prefix-length</span> <span style="color: #00bcff;">1</span>
        company-dabbrev-code-everywhere t
        company-dabbrev-code-other-buffers <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">all</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
<span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">company-quickhelp-delay 0.4)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6deab02" class="outline-3">
<h3 id="org6deab02"><span class="section-number-3">5.2</span> Disable tab</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> company
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">define-key!</span> <span style="color: #00d3d0;">company-active-map</span>
    <span style="color: #79a8ff;">"TAB"</span>       nil
    <span style="color: #6ae4b9;">[</span>tab<span style="color: #6ae4b9;">]</span>       nil<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org22d5762" class="outline-3">
<h3 id="org22d5762"><span class="section-number-3">5.3</span> Show yasnippets as company suggestions</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> company
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defvar</span> <span style="color: #00d3d0;">company-mode/enable-yas</span> t
    <span style="color: #c6eaff; font-style: italic;">"Enable yasnippet for all backends."</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">company-mode/backend-with-yas</span> <span style="color: #6ae4b9;">(</span>backend<span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">if</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">or</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">not</span> <span style="color: #00d3d0;">company-mode/enable-yas</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">and</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">listp</span> backend<span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">member</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">company-yasnippet</span> backend<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
        backend
      <span style="color: #00cd68;">(</span><span style="color: #00bcff;">append</span> <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">if</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">consp</span> backend<span style="color: #6ae4b9;">)</span> backend <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">list</span> backend<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
              <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #b6a0ff;">(</span><span style="color: #f78fe7; font-weight: bold;">:with</span> company-yasnippet<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">company-backends</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">mapcar</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-mode/backend-with-yas</span> <span style="color: #00d3d0;">company-backends</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf673fc2" class="outline-2">
<h2 id="orgf673fc2"><span class="section-number-2">6</span> Org</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgc275295" class="outline-3">
<h3 id="orgc275295"><span class="section-number-3">6.1</span> Better defaults</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> org
<span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">org-directory</span> <span style="color: #79a8ff;">"~/Dropbox/org"</span>
      <span style="color: #00d3d0;">org-image-actual-width</span> nil
      +org-export-directory <span style="color: #79a8ff;">"~/Dropbox/org/export"</span>
      <span style="color: #00d3d0;">org-default-notes-file</span> <span style="color: #79a8ff;">"~/Dropbox/org/personal/inbox.org"</span>
      org-id-locations-file <span style="color: #79a8ff;">"~/Dropbox/org/.orgids"</span>
      <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">org-agenda-files (directory-files-recursively "~/dropbox/org/" "\\.org$")</span>
      <span style="color: #00d3d0;">org-agenda-files</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"~/dropbox/org/personal/inbox.org"</span> <span style="color: #79a8ff;">"~/dropbox/org/personal/tasks.org"</span> <span style="color: #79a8ff;">"~/dropbox/org/personal/birthdays.org"</span><span style="color: #6ae4b9;">)</span>
      <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">org-export-in-background t</span>
      <span style="color: #00d3d0;">org-catch-invisible-edits</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">smart</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
