readme.html
<div id="outline-container-org2b87cf7" class="outline-3">
<h3 id="org2b87cf7"><span class="section-number-3">6.2</span> Capture templates</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> org

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">org-capture-templates</span>
        <span style="color: #b6a0ff; font-weight: bold;">`</span><span style="color: #6ae4b9;">(</span><span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"a"</span> <span style="color: #79a8ff;">"Article to write"</span> entry
           <span style="color: #b6a0ff;">(</span>file+headline <span style="color: #79a8ff;">"personal/tasks.org"</span> <span style="color: #79a8ff;">"Writing list"</span><span style="color: #b6a0ff;">)</span>
           ,<span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">concat</span> <span style="color: #79a8ff;">"* WRITE %^{Title} %^g\n"</span>
                    <span style="color: #79a8ff;">"SCHEDULED: %^t\n"</span>
                    <span style="color: #79a8ff;">":PROPERTIES:\n"</span>
                    <span style="color: #79a8ff;">":CAPTURED: %U\n:END:\n\n"</span>
                    <span style="color: #79a8ff;">"%i%?"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
          <span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"b"</span> <span style="color: #79a8ff;">"Basic task for future review"</span> entry
           <span style="color: #b6a0ff;">(</span>file+headline <span style="color: #79a8ff;">"personal/tasks.org"</span> <span style="color: #79a8ff;">"Basic tasks that need to be reviewed"</span><span style="color: #b6a0ff;">)</span>
           ,<span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">concat</span> <span style="color: #79a8ff;">"* %^{Title}\n"</span>
                    <span style="color: #79a8ff;">":PROPERTIES:\n"</span>
                    <span style="color: #79a8ff;">":CAPTURED: %U\n"</span>
                    <span style="color: #79a8ff;">":END:\n\n"</span>
                    <span style="color: #79a8ff;">"%i%l"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
          <span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"w"</span> <span style="color: #79a8ff;">"Task or assignment"</span> entry
           <span style="color: #b6a0ff;">(</span>file+headline <span style="color: #79a8ff;">"personal/tasks.org"</span> <span style="color: #79a8ff;">"Work tasks"</span><span style="color: #b6a0ff;">)</span>
           ,<span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">concat</span> <span style="color: #79a8ff;">"* </span><span style="color: #feacd0;">TODO</span><span style="color: #79a8ff;"> [#A] %^{Title} :@work:\n"</span>
                    <span style="color: #79a8ff;">"SCHEDULED: %^t\n"</span>
                    <span style="color: #79a8ff;">":PROPERTIES:\n:CAPTURED: %U\n:END:\n\n"</span>
                    <span style="color: #79a8ff;">"%i%?"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
          <span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"t"</span> <span style="color: #79a8ff;">"Task with a due date"</span> entry
           <span style="color: #b6a0ff;">(</span>file+headline <span style="color: #79a8ff;">"personal/tasks.org"</span> <span style="color: #79a8ff;">"Task list with a date"</span><span style="color: #b6a0ff;">)</span>
           ,<span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">concat</span> <span style="color: #79a8ff;">"* %^{Scope of task||</span><span style="color: #feacd0;">TODO</span><span style="color: #79a8ff;">|STUDY|MEET} %^{Title} %^g\n"</span>
                    <span style="color: #79a8ff;">"SCHEDULED: %^t\n"</span>
                    <span style="color: #79a8ff;">":PROPERTIES:\n:CAPTURED: %U\n:END:\n\n"</span>
                    <span style="color: #79a8ff;">"%i%?"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
          <span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"r"</span> <span style="color: #79a8ff;">"Reply to an email"</span> entry
           <span style="color: #b6a0ff;">(</span>file+headline <span style="color: #79a8ff;">"tasks.org"</span> <span style="color: #79a8ff;">"Mail correspondence"</span><span style="color: #b6a0ff;">)</span>
           ,<span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">concat</span> <span style="color: #79a8ff;">"* </span><span style="color: #feacd0;">TODO</span><span style="color: #79a8ff;"> [#B] %:subject :mail:\n"</span>
                    <span style="color: #79a8ff;">"SCHEDULED: %t\n:"</span>
                    <span style="color: #79a8ff;">"PROPERTIES:\n:CONTEXT: %a\n:END:\n\n"</span>
                    <span style="color: #79a8ff;">"%i%?"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-to-list</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">org-capture-templates</span>
             <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"d"</span> <span style="color: #79a8ff;">"New Diary Entry"</span> entry<span style="color: #00cd68;">(</span>file+olp+datetree<span style="color: #79a8ff;">"~/Dropbox/org/personal/diary.org"</span> <span style="color: #79a8ff;">"Daily Logs"</span><span style="color: #00cd68;">)</span>
<span style="color: #79a8ff;">"* %^{thought for the day}</span>
<span style="color: #79a8ff;">:PROPERTIES:</span>
<span style="color: #79a8ff;">:CATEGORY: %^{category}</span>
<span style="color: #79a8ff;">:SUBJECT:  %^{subject}</span>
<span style="color: #79a8ff;">:MOOD:     %^{mood}</span>
<span style="color: #79a8ff;">:END:</span>
<span style="color: #79a8ff;">:RESOURCES:</span>
<span style="color: #79a8ff;">:END:</span>

<span style="color: #79a8ff;">\*What was one good thing you learned today?*:</span>
<span style="color: #79a8ff;">- %^{whatilearnedtoday}</span>

<span style="color: #79a8ff;">\*List one thing you could have done better*:</span>
<span style="color: #79a8ff;">- %^{onethingdobetter}</span>

<span style="color: #79a8ff;">\*Describe in your own words how your day was*:</span>
<span style="color: #79a8ff;">- %?"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-to-list</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">org-capture-templates</span>
      <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"u"</span> <span style="color: #79a8ff;">"New URL Entry"</span> entry<span style="color: #00cd68;">(</span>file+function <span style="color: #79a8ff;">"~/Dropbox/org/personal/dailies.org"</span> org-reverse-datetree-goto-date-in-file<span style="color: #00cd68;">)</span>
            <span style="color: #79a8ff;">"* [[%^{URL}][%^{Description}]] %^g %?"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org01d2227" class="outline-3">
<h3 id="org01d2227"><span class="section-number-3">6.3</span> Prettify bullets</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> org-superstar
    <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> org-superstar-headline-bullets-list <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"&#10006;"</span> <span style="color: #79a8ff;">"&#10010;"</span> <span style="color: #79a8ff;">"&#9670;"</span> <span style="color: #79a8ff;">"&#9654;"</span> <span style="color: #79a8ff;">"&#9675;"</span><span style="color: #6ae4b9;">)</span>
        <span style="color: #00d3d0;">org-ellipsis</span> <span style="color: #79a8ff;">"&#9660;"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab8d884" class="outline-3">
<h3 id="orgab8d884"><span class="section-number-3">6.4</span> Org agenda popup</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"*org agenda*"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">right</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.40</span> <span style="color: #f78fe7; font-weight: bold;">:select</span> t <span style="color: #f78fe7; font-weight: bold;">:vslot</span> <span style="color: #00bcff;">2</span> <span style="color: #f78fe7; font-weight: bold;">:ttl</span> <span style="color: #00bcff;">3</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd01868a" class="outline-3">
<h3 id="orgd01868a"><span class="section-number-3">6.5</span> ox-ipynb</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #00bcff;">require</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">ox-ipynb</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org64bdc08" class="outline-3">
<h3 id="org64bdc08"><span class="section-number-3">6.6</span> Org babel clojure</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> evil-org
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">org-babel-clojure-backend</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">cider</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga0ee74c" class="outline-3">
<h3 id="orga0ee74c"><span class="section-number-3">6.7</span> <span class="todo TODO">TODO</span> Reveal</h3>
<div class="outline-text-3" id="text-6-7">
<p>
Update to reveal 4 at some point. Install the <code>toc-progress</code> plugin in the default <code>org-re-reveal-root</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> org-re-reveal
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">org-re-reveal-root</span> <span style="color: #79a8ff;">"./reveal.js"</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">org-re-reveal-revealjs-version</span> <span style="color: #79a8ff;">"3.8"</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">org-re-reveal-external-plugins</span>  <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #00cd68;">(</span>progress . <span style="color: #79a8ff;">"{ src: '%s/plugin/toc-progress/toc-progress.js', async: true, callback: function() { toc_progress.initialize(); toc_progress.create();} }"</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
