config.org
** org-cv
#+BEGIN_SRC emacs-lisp
(after! evil-org
    (use-package ox-moderncv
        :load-path "/Users/luca/git/org-cv/"
        :init (require 'ox-altacv))
        ;; :init (require 'ox-moderncv))
    )
#+END_SRC
** Use xelatex
#+BEGIN_SRC emacs-lisp
(after! latex
    (setq org-latex-compiler "xelatex"))
#+END_SRC
** HTML export does not fail when org links are present
#+BEGIN_SRC emacs-lisp
(after! org
  (defun html-body-id-filter (output backend info)
    "Remove random ID attributes generated by Org."
    (when (eq backend 'html)
      (replace-regexp-in-string
       " id=\"[[:alpha:]-]*org[[:alnum:]]\\{7\\}\""
       ""
       output t)))

  (add-to-list 'org-export-filter-final-output-functions 'html-body-id-filter))
#+END_SRC
