readme.html

<div id="outline-container-org40e329c" class="outline-3">
<h3 id="org40e329c"><span class="section-number-3">6.8</span> org-cv</h3>
<div class="outline-text-3" id="text-6-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> evil-org
    <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package</span> ox-moderncv
        <span style="color: #f78fe7; font-weight: bold;">:load-path</span> <span style="color: #79a8ff;">"/Users/luca/git/org-cv/"</span>
        <span style="color: #f78fe7; font-weight: bold;">:init</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">require</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">ox-altacv</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
        <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">:init (require 'ox-moderncv))</span>
    <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org82a3396" class="outline-3">
<h3 id="org82a3396"><span class="section-number-3">6.9</span> Use xelatex</h3>
<div class="outline-text-3" id="text-6-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> latex
    <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">org-latex-compiler</span> <span style="color: #79a8ff;">"xelatex"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2bf42d8" class="outline-3">
<h3 id="org2bf42d8"><span class="section-number-3">6.10</span> HTML export does not fail when org links are present</h3>
<div class="outline-text-3" id="text-6-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> org
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">html-body-id-filter</span> <span style="color: #6ae4b9;">(</span>output backend info<span style="color: #6ae4b9;">)</span>
    <span style="color: #c6eaff; font-style: italic;">"Remove random ID attributes generated by Org."</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">when</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">eq</span> backend <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">html</span><span style="color: #00cd68;">)</span>
      <span style="color: #00cd68;">(</span><span style="color: #00bcff;">replace-regexp-in-string</span>
       <span style="color: #79a8ff;">" id=\"[[:alpha:]-]*org[[:alnum:]]\\{7\\}\""</span>
       <span style="color: #79a8ff;">""</span>
       output t<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-to-list</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">org-export-filter-final-output-functions</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">html-body-id-filter</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
