config.org
** TODO org-tree-slide
#+BEGIN_SRC emacs-lisp :tangle no
(defvar my:slide-left-margin 10
  "Left margin during slideshow.")

(defvar my:slide-right-margin 10
  "Right margin during slideshow.")

(defvar my:slide-top-margin 500
  "Top margin, for face `header-line' :height.")

(defvar my:slide-fill-column-save nil
  "Max characters in a line when not displaying slideshow.")

(defvar my:slide-fill-column 42
  "Max characters in a line of paragraph text on a slide.")

(defvar my:org-src-block-faces nil
  "Stores src-block faces while presenting.")

(defvar my:org-slider-src-block-faces
  '(("emacs-lisp" (:background "black" :box nil)))
  "Override faces for source blocks during slideshow.")

(defvar my:slide-background nil ;;"#000000"
  "When non-nil, override background color.")

(defun my:show-headers ()
  "Called when stopping the slideshow."
  ;; restore org's source-block faces
  (setq org-src-block-faces my:org-src-block-faces)
  ;; restore fill-col
  (setq fill-column my:slide-fill-column-save)
  ;; turn off the fringe
  (set-fringe-mode nil)
  ;; tear-down headerline
  (setq header-line-format nil)
  (merge-face-attribute 'header-line :height 1)
  ;; remove margins
  (set-window-margins (get-buffer-window (current-buffer)) 0 0)
  ;; restore hidden block headers
  (hide-lines-show-all)
  ;; expand everything when exiting the presentation
  (org-show-all))

(defun my:hide-headers ()
  "Called when starting the slideshow."
  ;; preserve org's source block faces then overide them
  (setq my:org-src-block-faces org-src-block-faces)
  (setq org-src-block-faces my:org-slider-src-block-faces)

  ;; preserve then set fill-column
  (setq my:slide-fill-column-save fill-column)
  (setq fill-column my:slide-fill-column)

  ;; expressly turn off boxing and restyle background (thanks Drew)
  ;; https://stackoverflow.com/questions/19201358/how-to-get-emacs-background-color
  (let ((bg (or my:slide-background
                (face-attribute 'default :background))))
    (set-face-attribute 'header-line nil
                        :height my:slide-top-margin
                        :box nil
                        :background bg)
    (dolist (aface '(org-code org-tree-slide-header-overlay-face))
      (merge-face-attribute aface :background bg)))

  ;; turn off the fringe
  (set-fringe-mode (cons 0 0))
  ;; use header-line for top-margin
  (setq header-line-format "")
  ;; setup margins
  (set-window-margins (get-buffer-window (current-buffer))
                      my:slide-left-margin
                      my:slide-right-margin)
  ;; hide block begin/end markers
  ;; not sure why but hide-lines *really* needs
  ;; loaded each time we call this..
  (load-library "hide-lines")
  (hide-lines-matching
   "#\\+\\(BEGIN\\|END\\)_\\(SRC\\|EXAMPLE\\|VERSE\\|QUOTE\\)"))

;; TODO maybe need to add to packages.el
;; help us hide the begin/end blocks
(use-package hide-lines :ensure t :demand)

(use-package org-tree-slide :ensure t :demand
             :bind ("C-<f2>" . org-tree-slide-mode)
             :hook ((org-tree-slide-play . my:hide-headers)
                (org-tree-slide-stop . my:show-headers))
             :config
             ;; this advice will save/restore src block faces if we use C-c '
             (defun advice:org-edit-src-code (&rest _)
               (interactive) (my:show-headers))
             (advice-add 'org-edit-src-code :before #'advice:org-edit-src-code)
             (defun advice:org-edit-src-exit ()
               (interactive) (my:hide-headers))
             (advice-add 'org-edit-src-exit :after #'advice:org-edit-src-exit))
#+END_SRC

