readme.html
<div id="outline-container-org4ed19b9" class="outline-3">
<h3 id="org4ed19b9"><span class="section-number-3">6.11</span> <span class="todo TODO">TODO</span> org-tree-slide</h3>
<div class="outline-text-3" id="text-6-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defvar</span> <span style="color: #00d3d0;">my:slide-left-margin</span> <span style="color: #00bcff;">10</span>
  <span style="color: #c6eaff; font-style: italic;">"Left margin during slideshow."</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defvar</span> <span style="color: #00d3d0;">my:slide-right-margin</span> <span style="color: #00bcff;">10</span>
  <span style="color: #c6eaff; font-style: italic;">"Right margin during slideshow."</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defvar</span> <span style="color: #00d3d0;">my:slide-top-margin</span> <span style="color: #00bcff;">500</span>
  <span style="color: #c6eaff; font-style: italic;">"Top margin, for face `</span><span style="color: #00bcff; font-style: italic;">header-line</span><span style="color: #c6eaff; font-style: italic;">' :height."</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defvar</span> <span style="color: #00d3d0;">my:slide-fill-column-save</span> nil
  <span style="color: #c6eaff; font-style: italic;">"Max characters in a line when not displaying slideshow."</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defvar</span> <span style="color: #00d3d0;">my:slide-fill-column</span> <span style="color: #00bcff;">42</span>
  <span style="color: #c6eaff; font-style: italic;">"Max characters in a line of paragraph text on a slide."</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defvar</span> <span style="color: #00d3d0;">my:org-src-block-faces</span> nil
  <span style="color: #c6eaff; font-style: italic;">"Stores src-block faces while presenting."</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defvar</span> <span style="color: #00d3d0;">my:org-slider-src-block-faces</span>
  <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"emacs-lisp"</span> <span style="color: #00cd68;">(</span><span style="color: #f78fe7; font-weight: bold;">:background</span> <span style="color: #79a8ff;">"black"</span> <span style="color: #f78fe7; font-weight: bold;">:box</span> nil<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #c6eaff; font-style: italic;">"Override faces for source blocks during slideshow."</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defvar</span> <span style="color: #00d3d0;">my:slide-background</span> nil <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">"#000000"</span>
  <span style="color: #c6eaff; font-style: italic;">"When non-nil, override background color."</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">my:show-headers</span> <span style="color: #b6a0ff;">()</span>
  <span style="color: #c6eaff; font-style: italic;">"Called when stopping the slideshow."</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">restore org's source-block faces</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">org-src-block-faces</span> my:org-src-block-faces<span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">restore fill-col</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">fill-column</span> my:slide-fill-column-save<span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">turn off the fringe</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">set-fringe-mode</span> nil<span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">tear-down headerline</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">header-line-format</span> nil<span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">merge-face-attribute</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">header-line</span> <span style="color: #f78fe7; font-weight: bold;">:height</span> <span style="color: #00bcff;">1</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">remove margins</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">set-window-margins</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">get-buffer-window</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">current-buffer</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span> <span style="color: #00bcff;">0</span> <span style="color: #00bcff;">0</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">restore hidden block headers</span>
  <span style="color: #b6a0ff;">(</span>hide-lines-show-all<span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">expand everything when exiting the presentation</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">org-show-all</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">my:hide-headers</span> <span style="color: #b6a0ff;">()</span>
  <span style="color: #c6eaff; font-style: italic;">"Called when starting the slideshow."</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">preserve org's source block faces then overide them</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> my:org-src-block-faces <span style="color: #00d3d0;">org-src-block-faces</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">org-src-block-faces</span> my:org-slider-src-block-faces<span style="color: #b6a0ff;">)</span>

  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">preserve then set fill-column</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> my:slide-fill-column-save <span style="color: #00d3d0;">fill-column</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">fill-column</span> my:slide-fill-column<span style="color: #b6a0ff;">)</span>

  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">expressly turn off boxing and restyle background (thanks Drew)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">https://stackoverflow.com/questions/19201358/how-to-get-emacs-background-color</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">let</span> <span style="color: #6ae4b9;">(</span><span style="color: #00cd68;">(</span>bg <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">or</span> my:slide-background
                <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">face-attribute</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">default</span> <span style="color: #f78fe7; font-weight: bold;">:background</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">set-face-attribute</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">header-line</span> nil
                        <span style="color: #f78fe7; font-weight: bold;">:height</span> my:slide-top-margin
                        <span style="color: #f78fe7; font-weight: bold;">:box</span> nil
                        <span style="color: #f78fe7; font-weight: bold;">:background</span> bg<span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">dolist</span> <span style="color: #00cd68;">(</span>aface <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #b6a0ff;">(</span>org-code org-tree-slide-header-overlay-face<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
      <span style="color: #00cd68;">(</span><span style="color: #00bcff;">merge-face-attribute</span> aface <span style="color: #f78fe7; font-weight: bold;">:background</span> bg<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">turn off the fringe</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">set-fringe-mode</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">cons</span> <span style="color: #00bcff;">0</span> <span style="color: #00bcff;">0</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">use header-line for top-margin</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">header-line-format</span> <span style="color: #79a8ff;">""</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">setup margins</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">set-window-margins</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">get-buffer-window</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">current-buffer</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
                      my:slide-left-margin
                      my:slide-right-margin<span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">hide block begin/end markers</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">not sure why but hide-lines *really* needs</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">loaded each time we call this..</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">load-library</span> <span style="color: #79a8ff;">"hide-lines"</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span>hide-lines-matching
   <span style="color: #79a8ff;">"#\\+</span><span style="color: #abab00; font-weight: bold;">\\</span><span style="color: #e7a59a; font-weight: bold;">(</span><span style="color: #79a8ff;">BEGIN</span><span style="color: #abab00; font-weight: bold;">\\</span><span style="color: #e7a59a; font-weight: bold;">|</span><span style="color: #79a8ff;">END</span><span style="color: #abab00; font-weight: bold;">\\</span><span style="color: #e7a59a; font-weight: bold;">)</span><span style="color: #79a8ff;">_</span><span style="color: #abab00; font-weight: bold;">\\</span><span style="color: #e7a59a; font-weight: bold;">(</span><span style="color: #79a8ff;">SRC</span><span style="color: #abab00; font-weight: bold;">\\</span><span style="color: #e7a59a; font-weight: bold;">|</span><span style="color: #79a8ff;">EXAMPLE</span><span style="color: #abab00; font-weight: bold;">\\</span><span style="color: #e7a59a; font-weight: bold;">|</span><span style="color: #79a8ff;">VERSE</span><span style="color: #abab00; font-weight: bold;">\\</span><span style="color: #e7a59a; font-weight: bold;">|</span><span style="color: #79a8ff;">QUOTE</span><span style="color: #abab00; font-weight: bold;">\\</span><span style="color: #e7a59a; font-weight: bold;">)</span><span style="color: #79a8ff;">"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #feacd0;">TODO</span><span style="color: #a8a8a8; font-style: italic;"> maybe need to add to packages.el</span>
<span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">help us hide the begin/end blocks</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package</span> hide-lines <span style="color: #f78fe7; font-weight: bold;">:ensure</span> t <span style="color: #f78fe7; font-weight: bold;">:demand</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package</span> org-tree-slide <span style="color: #f78fe7; font-weight: bold;">:ensure</span> t <span style="color: #f78fe7; font-weight: bold;">:demand</span>
             <span style="color: #f78fe7; font-weight: bold;">:bind</span> <span style="color: #b6a0ff;">(</span><span style="color: #79a8ff;">"C-&lt;f2&gt;"</span> . org-tree-slide-mode<span style="color: #b6a0ff;">)</span>
             <span style="color: #f78fe7; font-weight: bold;">:hook</span> <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span>org-tree-slide-play . my:hide-headers<span style="color: #6ae4b9;">)</span>
                <span style="color: #6ae4b9;">(</span>org-tree-slide-stop . my:show-headers<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
             <span style="color: #f78fe7; font-weight: bold;">:config</span>
             <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">this advice will save/restore src block faces if we use C-c '</span>
             <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">advice:org-edit-src-code</span> <span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">&amp;rest</span> _<span style="color: #6ae4b9;">)</span>
               <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span><span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span>my:show-headers<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
             <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">advice-add</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">org-edit-src-code</span> <span style="color: #f78fe7; font-weight: bold;">:before</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">advice:org-edit-src-code</span><span style="color: #b6a0ff;">)</span>
             <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">advice:org-edit-src-exit</span> <span style="color: #6ae4b9;">()</span>
               <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span><span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span>my:hide-headers<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
             <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">advice-add</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">org-edit-src-exit</span> <span style="color: #f78fe7; font-weight: bold;">:after</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">advice:org-edit-src-exit</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>
