readme.html

<div id="outline-container-orgfb3d2f9" class="outline-2">
<h2 id="orgfb3d2f9"><span class="section-number-2">7</span> emacs-jupyter</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org208d4cd" class="outline-3">
<h3 id="org208d4cd"><span class="section-number-3">7.1</span> Org default header arguments:</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> evil-org
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> org-babel-default-header-args:jupyter-python <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #00cd68;">(</span><span style="color: #f78fe7; font-weight: bold;">:async</span> . <span style="color: #79a8ff;">"yes"</span><span style="color: #00cd68;">)</span>
                                                       <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(:pandoc t)</span>
                                                       <span style="color: #00cd68;">(</span><span style="color: #f78fe7; font-weight: bold;">:kernel</span> . <span style="color: #79a8ff;">"python3"</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> org-babel-default-header-args:jupyter-R <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(:pandoc t)</span>
                                                  <span style="color: #00cd68;">(</span><span style="color: #f78fe7; font-weight: bold;">:kernel</span> . <span style="color: #79a8ff;">"ir"</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcad939e" class="outline-3">
<h3 id="orgcad939e"><span class="section-number-3">7.2</span> Key bindings:</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(:when (featurep! :lang +jupyter)</span>
<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:after</span> evil-org
      <span style="color: #f78fe7; font-weight: bold;">:map</span> <span style="color: #00d3d0;">evil-org-mode-map</span>
      <span style="color: #f78fe7; font-weight: bold;">:leader</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"tangle"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"ct"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">org-babel-tangle</span>
      <span style="color: #f78fe7; font-weight: bold;">:localleader</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Hydra"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">","</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-org-hydra/body</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Inspect at point"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"?"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-inspect-at-point</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Execute and step"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"RET"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-org-execute-and-next-block</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Delete code block"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"x"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-org-kill-block-and-results</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"New code block above"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"+"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-org-insert-src-block</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"New code block below"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"="</span> <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">&#955;!</span> <span style="color: #6ae4b9;">()</span> <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span><span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span><span style="color: #feacd0;">jupyter-org-insert-src-block</span> t nil<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Merge code blocks"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"m"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-org-merge-blocks</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Split code block"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"-"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-org-split-src-block</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Fold results"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"z"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">org-babel-hide-result-toggle</span>

      <span style="color: #f78fe7; font-weight: bold;">:map</span> <span style="color: #00d3d0;">org-src-mode-map</span>
      <span style="color: #f78fe7; font-weight: bold;">:localleader</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Exit edit"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"'"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">org-edit-src-exit</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:after</span> python
      <span style="color: #f78fe7; font-weight: bold;">:map</span> <span style="color: #00d3d0;">python-mode-map</span>
      <span style="color: #f78fe7; font-weight: bold;">:localleader</span>
      <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"eval"</span> <span style="color: #f78fe7; font-weight: bold;">:prefix</span> <span style="color: #79a8ff;">"e"</span>
       <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"line or region"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"e"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-eval-line-or-region</span>
        <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"defun"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"d"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-eval-defun</span>
       <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"buffer"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"b"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-eval-buffer</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org313da6f" class="outline-3">
<h3 id="org313da6f"><span class="section-number-3">7.3</span> Popups</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"*jupyter-pager*"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">right</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.40</span> <span style="color: #f78fe7; font-weight: bold;">:select</span> t <span style="color: #f78fe7; font-weight: bold;">:vslot</span> <span style="color: #00bcff;">2</span> <span style="color: #f78fe7; font-weight: bold;">:ttl</span> <span style="color: #00bcff;">3</span><span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"^\\*Org Src*"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">right</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.60</span> <span style="color: #f78fe7; font-weight: bold;">:select</span> t <span style="color: #f78fe7; font-weight: bold;">:vslot</span> <span style="color: #00bcff;">2</span> <span style="color: #f78fe7; font-weight: bold;">:ttl</span> <span style="color: #00bcff;">3</span> <span style="color: #f78fe7; font-weight: bold;">:quit</span> nil<span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"*jupyter-repl*"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">bottom</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.30</span> <span style="color: #f78fe7; font-weight: bold;">:vslot</span> <span style="color: #00bcff;">2</span> <span style="color: #f78fe7; font-weight: bold;">:ttl</span> <span style="color: #00bcff;">3</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0edb322" class="outline-3">
<h3 id="org0edb322"><span class="section-number-3">7.4</span> <span class="todo TODO">TODO</span> Library of babel</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(after! evil-org</span>
<span style="color: #a8a8a8; font-style: italic;">;;   </span><span style="color: #a8a8a8; font-style: italic;">(org-babel-lob-ingest "/Users/luca/git/experiments/literate/ml/rpy2.org"))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7341486" class="outline-3">
<h3 id="org7341486"><span class="section-number-3">7.5</span> Eval handler</h3>
<div class="outline-text-3" id="text-7-5">
<p>
With <code>g r</code> we can send code to the Jupyter REPL:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> ob-jupyter
  <span style="color: #b6a0ff;">(</span><span style="color: #feacd0;">set-eval-handler!</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">jupyter-repl-interaction-mode</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-eval-line-or-region</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
