config.org
** Set REPL handler
On a scratch buffer, first run ~jupyter-associate-buffer~.
Then, hitting ~SPC o r~ allows use to hit the REPL buffer with the lines/regions
of code we send with ~g r~.
#+BEGIN_SRC emacs-lisp
(add-hook! python-mode
  (set-repl-handler! 'python-mode #'jupyter-repl-pop-to-buffer))
#+END_SRC
** TODO Use overlays
Evaluate simple expressions to the right of the symbol with =, e e=
#+BEGIN_SRC emacs-lisp
;; (after! ob-jupyter
;;   (setq jupyter-eval-use-overlays t))
#+END_SRC
** Long outputs
#+BEGIN_SRC emacs-lisp
(after! ob-jupyter
  (cl-defmethod jupyter-org--insert-result (_req context result)
    (let ((str
           (org-element-interpret-data
            (jupyter-org--wrap-result-maybe
             context (if (jupyter-org--stream-result-p result)
                         (thread-last result
                           jupyter-org-strip-last-newline
                           jupyter-org-scalar)
                       result)))))
      (if (< (length str) 100000)
          (insert str)
        (insert (format ": Result was too long! Length was %d" (length str)))))
    (when (/= (point) (line-beginning-position))
      ;; Org objects such as file links do not have a newline added when
      ;; converting to their string representation by
      ;; `org-element-interpret-data' so insert one in these cases.
      (insert "\n"))))
#+END_SRC

** Fix zmq keywords
#+BEGIN_SRC emacs-lisp
(defadvice! fixed-zmq-start-process (orig-fn &rest args)
  :around #'zmq-start-process
  (letf! (defun make-process (&rest plist)
           (plist-put! plist :coding (plist-get plist :coding-system))
           (plist-delete! plist :coding-system)
           (apply make-process plist))
    (apply orig-fn args)))
#+END_SRC
** TODO Unmap org-metadown
#+BEGIN_SRC emacs-lisp
;; (map! :after org-evil
;;         :map evil-org-mode-map
;;       :n "M-<down>" nil
;;       :n "M-j" nil
;;       )

#+END_SRC
