readme.html

<div id="outline-container-org5219b17" class="outline-3">
<h3 id="org5219b17"><span class="section-number-3">7.6</span> Set REPL handler</h3>
<div class="outline-text-3" id="text-7-6">
<p>
On a scratch buffer, first run <code>jupyter-associate-buffer</code>.
Then, hitting <code>SPC o r</code> allows use to hit the REPL buffer with the lines/regions
of code we send with <code>g r</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">add-hook!</span> python-mode
  <span style="color: #b6a0ff;">(</span><span style="color: #feacd0;">set-repl-handler!</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">python-mode</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-repl-pop-to-buffer</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org08fbda8" class="outline-3">
<h3 id="org08fbda8"><span class="section-number-3">7.7</span> <span class="todo TODO">TODO</span> Use overlays</h3>
<div class="outline-text-3" id="text-7-7">
<p>
Evaluate simple expressions to the right of the symbol with <code>, e e</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(after! ob-jupyter</span>
<span style="color: #a8a8a8; font-style: italic;">;;   </span><span style="color: #a8a8a8; font-style: italic;">(setq jupyter-eval-use-overlays t))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org61d395f" class="outline-3">
<h3 id="org61d395f"><span class="section-number-3">7.8</span> Long outputs</h3>
<div class="outline-text-3" id="text-7-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> ob-jupyter
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">cl-defmethod</span> <span style="color: #feacd0;">jupyter-org--insert-result</span> <span style="color: #6ae4b9;">(</span>_req context result<span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">let</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">(</span>str
           <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">org-element-interpret-data</span>
            <span style="color: #00cd68;">(</span><span style="color: #feacd0;">jupyter-org--wrap-result-maybe</span>
             context <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">if</span> <span style="color: #6ae4b9;">(</span><span style="color: #feacd0;">jupyter-org--stream-result-p</span> result<span style="color: #6ae4b9;">)</span>
                         <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">thread-last</span> result
                           jupyter-org-strip-last-newline
                           jupyter-org-scalar<span style="color: #6ae4b9;">)</span>
                       result<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
      <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">if</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">&lt;</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">length</span> str<span style="color: #6ae4b9;">)</span> <span style="color: #00bcff;">100000</span><span style="color: #b6a0ff;">)</span>
          <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">insert</span> str<span style="color: #b6a0ff;">)</span>
        <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">insert</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">format</span> <span style="color: #79a8ff;">": Result was too long! Length was %d"</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">length</span> str<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">when</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">/=</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">point</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">line-beginning-position</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
      <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Org objects such as file links do not have a newline added when</span>
      <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">converting to their string representation by</span>
      <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">`</span><span style="color: #00bcff; font-style: italic;">org-element-interpret-data</span><span style="color: #a8a8a8; font-style: italic;">' so insert one in these cases.</span>
      <span style="color: #00cd68;">(</span><span style="color: #00bcff;">insert</span> <span style="color: #79a8ff;">"\n"</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7cc258d" class="outline-3">
<h3 id="org7cc258d"><span class="section-number-3">7.9</span> Fix zmq keywords</h3>
<div class="outline-text-3" id="text-7-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defadvice!</span> fixed-zmq-start-process <span style="color: #b6a0ff;">(</span>orig-fn <span style="color: #f78fe7;">&amp;rest</span> args<span style="color: #b6a0ff;">)</span>
  <span style="color: #f78fe7; font-weight: bold;">:around</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">zmq-start-process</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">letf!</span> <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">make-process</span> <span style="color: #00cd68;">(</span><span style="color: #f78fe7;">&amp;rest</span> plist<span style="color: #00cd68;">)</span>
           <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">plist-put!</span> plist <span style="color: #f78fe7; font-weight: bold;">:coding</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">plist-get</span> plist <span style="color: #f78fe7; font-weight: bold;">:coding-system</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
           <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">plist-delete!</span> plist <span style="color: #f78fe7; font-weight: bold;">:coding-system</span><span style="color: #00cd68;">)</span>
           <span style="color: #00cd68;">(</span><span style="color: #00bcff;">apply</span> make-process plist<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">apply</span> orig-fn args<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbae892b" class="outline-3">
<h3 id="orgbae892b"><span class="section-number-3">7.10</span> <span class="todo TODO">TODO</span> Unmap org-metadown</h3>
<div class="outline-text-3" id="text-7-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(map! :after org-evil</span>
<span style="color: #a8a8a8; font-style: italic;">;;         </span><span style="color: #a8a8a8; font-style: italic;">:map evil-org-mode-map</span>
<span style="color: #a8a8a8; font-style: italic;">;;       </span><span style="color: #a8a8a8; font-style: italic;">:n "M-&lt;down&gt;" nil</span>
<span style="color: #a8a8a8; font-style: italic;">;;       </span><span style="color: #a8a8a8; font-style: italic;">:n "M-j" nil</span>
<span style="color: #a8a8a8; font-style: italic;">;;       </span><span style="color: #a8a8a8; font-style: italic;">)</span>

</pre>
</div>
</div>
</div>
