readme.html
<div id="outline-container-org6903099" class="outline-3">
<h3 id="org6903099"><span class="section-number-3">7.11</span> <span class="todo TODO">TODO</span> scimax utilities</h3>
<div class="outline-text-3" id="text-7-11">
<p>
Found at <a href="https://github.com/nnicandro/emacs-jupyter/issues/160">https://github.com/nnicandro/emacs-jupyter/issues/160</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> jupyter
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">jupyter-run-repl-or-pop-to-buffer-dwim</span> <span style="color: #6ae4b9;">()</span>
    <span style="color: #c6eaff; font-style: italic;">"If a buffer is already associated with a jupyter buffer,</span>
<span style="color: #c6eaff; font-style: italic;">then pop to it. Otherwise start a jupyter kernel."</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">if</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">bound-and-true-p</span> <span style="color: #00d3d0;">jupyter-current-client</span><span style="color: #00cd68;">)</span>
        <span style="color: #00cd68;">(</span><span style="color: #feacd0;">jupyter-repl-pop-to-buffer</span><span style="color: #00cd68;">)</span>
      <span style="color: #00cd68;">(</span><span style="color: #00bcff;">call-interactively</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">jupyter-run-repl</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">* eldoc integration</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">scimax-jupyter-signature</span> <span style="color: #6ae4b9;">()</span>
    <span style="color: #c6eaff; font-style: italic;">"Try to return a function signature for the thing at point."</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">when</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">and</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">eql</span> <span style="color: #00d3d0;">major-mode</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">org-mode</span><span style="color: #b6a0ff;">)</span>
               <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">string=</span> <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">or</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">get-text-property</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">point</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">lang</span><span style="color: #00cd68;">)</span> <span style="color: #79a8ff;">""</span><span style="color: #6ae4b9;">)</span> <span style="color: #79a8ff;">"jupyter-python"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
      <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">save-window-excursion</span>
     <span style="color: #a8a8a8; font-style: italic;">;;; </span><span style="color: #a8a8a8; font-style: italic;">Essentially copied from (jupyter-inspect-at-point).</span>
        <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">jupyter-org-with-src-block-client</span>
         <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">cl-destructuring-bind</span> <span style="color: #00cd68;">(</span>code pos<span style="color: #00cd68;">)</span>
             <span style="color: #00cd68;">(</span><span style="color: #feacd0;">jupyter-code-context</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">inspect</span><span style="color: #00cd68;">)</span>
           <span style="color: #00cd68;">(</span><span style="color: #feacd0;">jupyter-inspect</span> code pos nil <span style="color: #00bcff;">0</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
        <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">when</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">get-buffer</span> <span style="color: #79a8ff;">"*Help*"</span><span style="color: #6ae4b9;">)</span>
          <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">with-current-buffer</span> <span style="color: #79a8ff;">"*Help*"</span>
            <span style="color: #00cd68;">(</span><span style="color: #00bcff;">goto-char</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">point-min</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
            <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">prog1</span>
                <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">cond</span>
                 <span style="color: #6ae4b9;">(</span><span style="color: #00cd68;">(</span><span style="color: #00bcff;">re-search-forward</span> <span style="color: #79a8ff;">"Signature:"</span> nil t <span style="color: #00bcff;">1</span><span style="color: #00cd68;">)</span>
                  <span style="color: #00cd68;">(</span><span style="color: #00bcff;">buffer-substring</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">line-beginning-position</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">line-end-position</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
                 <span style="color: #6ae4b9;">(</span><span style="color: #00cd68;">(</span><span style="color: #00bcff;">re-search-forward</span> <span style="color: #79a8ff;">"Docstring:"</span> nil t <span style="color: #00bcff;">1</span><span style="color: #00cd68;">)</span>
                  <span style="color: #00cd68;">(</span><span style="color: #00bcff;">forward-line</span><span style="color: #00cd68;">)</span>
                  <span style="color: #00cd68;">(</span><span style="color: #00bcff;">buffer-substring</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">line-beginning-position</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">line-end-position</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
                 <span style="color: #6ae4b9;">(</span>t
                  nil<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
              <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">get rid of this so we don't accidentally show old results later</span>
              <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">with-current-buffer</span> <span style="color: #79a8ff;">"*Help*"</span>
                <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">toggle-read-only</span><span style="color: #6ae4b9;">)</span>
                <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">erase-buffer</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">scimax-jupyter-eldoc-advice</span> <span style="color: #6ae4b9;">(</span>orig-func <span style="color: #f78fe7;">&amp;rest</span> args<span style="color: #6ae4b9;">)</span>
    <span style="color: #c6eaff; font-style: italic;">"Advice function to get eldoc signatures in blocks in org-mode."</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">or</span> <span style="color: #00cd68;">(</span>scimax-jupyter-signature<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">apply</span> orig-func args<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>


  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">scimax-jupyter-turn-on-eldoc</span> <span style="color: #6ae4b9;">()</span>
    <span style="color: #c6eaff; font-style: italic;">"Turn on eldoc signatures."</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">advice-add</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">org-eldoc-documentation-function</span> <span style="color: #f78fe7; font-weight: bold;">:around</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">scimax-jupyter-eldoc-advice</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span> scimax-jupyter-turn-on-eldoc <span style="color: #b6a0ff;">)</span>
  <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org28ff361" class="outline-2">
<h2 id="org28ff361"><span class="section-number-2">8</span> Python</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgeb319ec" class="outline-3">
<h3 id="orgeb319ec"><span class="section-number-3">8.1</span> REPL</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-orgd7c3f98" class="outline-4">
<h4 id="orgd7c3f98"><span class="section-number-4">8.1.1</span> virtualenv executable</h4>
<div class="outline-text-4" id="text-8-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defadvice!</span> +python-poetry-open-repl-a <span style="color: #b6a0ff;">(</span>orig-fn <span style="color: #f78fe7;">&amp;rest</span> args<span style="color: #b6a0ff;">)</span>
  <span style="color: #c6eaff; font-style: italic;">"Use the Python binary from the current virtual environment."</span>
  <span style="color: #f78fe7; font-weight: bold;">:around</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">+python/open-repl</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">if</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">getenv</span> <span style="color: #79a8ff;">"VIRTUAL_ENV"</span><span style="color: #6ae4b9;">)</span>
      <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">let</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">(</span><span style="color: #00d3d0;">python-shell-interpreter</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">executable-find</span> <span style="color: #79a8ff;">"ipython"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
        <span style="color: #00cd68;">(</span><span style="color: #00bcff;">apply</span> orig-fn args<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">apply</span> orig-fn args<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org51eeec8" class="outline-4">
<h4 id="org51eeec8"><span class="section-number-4">8.1.2</span> Silence warnings when opening REPL</h4>
<div class="outline-text-4" id="text-8-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">python-shell-prompt-detect-failure-warning</span> nil<span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
