config.org
*** Ignore popup rule
#+BEGIN_SRC emacs-lisp
(set-popup-rule! "^\\*Python*" :ignore t)
#+END_SRC
*** Disable native completion
#+BEGIN_SRC emacs-lisp
(after! python
  (setq python-shell-completion-native-enable nil))
#+END_SRC

** LSP
*** Use pyright
#+BEGIN_SRC emacs-lisp
(after! lsp-python-ms
  (set-lsp-priority! 'pyright 1))
#+END_SRC

*** Don't guess project root
In case we get a wrong workspace root, we can delete it with ~lsp-workspace-folders-remove~
#+BEGIN_SRC emacs-lisp
(after! lsp-mode
  (setq lsp-auto-guess-root nil))
#+END_SRC

#+begin_src emacs-lisp
(after! projectile
  (setq projectile-project-root-files '("Dockerfile" "pyproject.toml" "project.clj")))
#+end_src

*** Increase bytes read from subprocess
#+BEGIN_SRC emacs-lisp
(setq read-process-output-max (* 1024 1024))
#+END_SRC
*** lsp-help popup
Lookup documentation with ~SPC c k~
#+BEGIN_SRC emacs-lisp
(set-popup-rule! "^\\*lsp-help" :side 'right :size .50 :select t :vslot 1)
#+END_SRC
*** Disable lsp flycheck checker and use flake8
#+BEGIN_SRC emacs-lisp
(after! lsp-mode
  (setq lsp-diagnostic-package :none))

(after! flycheck
    (add-hook 'pyhon-mode-local-vars-hook
            (lambda ()
                (when (flycheck-may-enable-checker 'python-flake8)
                (flycheck-select-checker 'python-flake8)))))
  ;; (setq flycheck-disabled-checkers 'lsp)
#+END_SRC

*** UI
#+BEGIN_SRC emacs-lisp
(after! lsp-mode
  (setq lsp-eldoc-enable-hover nil
        lsp-signature-auto-activate nil
        ;; lsp-enable-on-type-formatting nil
        ;; lsp-enable-symbol-highlighting nil
        lsp-enable-file-watchers nil))
#+END_SRC
*** Don't restart on exit
#+BEGIN_SRC emacs-lisp
(after! lsp-mode
  (setq lsp-restart 'ignore))
#+END_SRC
*** TODO Eglot
#+BEGIN_SRC emacs-lisp :tangle no
(when (featurep! +eglot)
  (after! eglot
    (add-to-list 'eglot-server-programs '(python-mode . ("pyright-langserver" "--stdio"))))
  )
#+END_SRC


** Pytest
#+BEGIN_SRC emacs-lisp
(after! python-pytest
  (setq python-pytest-arguments '("--color" "--failed-first"))
  (evil-set-initial-state 'python-pytest-mode 'normal))

(set-popup-rule! "^\\*pytest*" :side 'right :size .50)
#+END_SRC
** dap-mode
