readme.html
<div id="outline-container-orgedcd5a0" class="outline-4">
<h4 id="orgedcd5a0"><span class="section-number-4">8.1.3</span> Ignore popup rule</h4>
<div class="outline-text-4" id="text-8-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"^\\*Python*"</span> <span style="color: #f78fe7; font-weight: bold;">:ignore</span> t<span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1b0d688" class="outline-4">
<h4 id="org1b0d688"><span class="section-number-4">8.1.4</span> Disable native completion</h4>
<div class="outline-text-4" id="text-8-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> python
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">python-shell-completion-native-enable</span> nil<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4eb1ecf" class="outline-3">
<h3 id="org4eb1ecf"><span class="section-number-3">8.2</span> LSP</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-org93c5d76" class="outline-4">
<h4 id="org93c5d76"><span class="section-number-4">8.2.1</span> Use pyright</h4>
<div class="outline-text-4" id="text-8-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> lsp-python-ms
  <span style="color: #b6a0ff;">(</span><span style="color: #feacd0;">set-lsp-priority!</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">pyright</span> <span style="color: #00bcff;">1</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge94fbae" class="outline-4">
<h4 id="orge94fbae"><span class="section-number-4">8.2.2</span> Don&rsquo;t guess project root</h4>
<div class="outline-text-4" id="text-8-2-2">
<p>
In case we get a wrong workspace root, we can delete it with <code>lsp-workspace-folders-remove</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> <span style="color: #00d3d0;">lsp-mode</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">lsp-auto-guess-root</span> nil<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> projectile
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">projectile-project-root-files</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"Dockerfile"</span> <span style="color: #79a8ff;">"pyproject.toml"</span> <span style="color: #79a8ff;">"project.clj"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org19ec5de" class="outline-4">
<h4 id="org19ec5de"><span class="section-number-4">8.2.3</span> Increase bytes read from subprocess</h4>
<div class="outline-text-4" id="text-8-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">read-process-output-max</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">*</span> <span style="color: #00bcff;">1024</span> <span style="color: #00bcff;">1024</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge108217" class="outline-4">
<h4 id="orge108217"><span class="section-number-4">8.2.4</span> lsp-help popup</h4>
<div class="outline-text-4" id="text-8-2-4">
<p>
Lookup documentation with <code>SPC c k</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"^\\*lsp-help"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">right</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.50</span> <span style="color: #f78fe7; font-weight: bold;">:select</span> t <span style="color: #f78fe7; font-weight: bold;">:vslot</span> <span style="color: #00bcff;">1</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0553640" class="outline-4">
<h4 id="org0553640"><span class="section-number-4">8.2.5</span> Disable lsp flycheck checker and use flake8</h4>
<div class="outline-text-4" id="text-8-2-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> <span style="color: #00d3d0;">lsp-mode</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">lsp-diagnostic-package</span> <span style="color: #f78fe7; font-weight: bold;">:none</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> flycheck
    <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">pyhon-mode-local-vars-hook</span>
            <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">lambda</span> <span style="color: #00cd68;">()</span>
                <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">when</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">flycheck-may-enable-checker</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">python-flake8</span><span style="color: #b6a0ff;">)</span>
                <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">flycheck-select-checker</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">python-flake8</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq flycheck-disabled-checkers 'lsp)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ceaa6d" class="outline-4">
<h4 id="org9ceaa6d"><span class="section-number-4">8.2.6</span> UI</h4>
<div class="outline-text-4" id="text-8-2-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> <span style="color: #00d3d0;">lsp-mode</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">lsp-eldoc-enable-hover</span> nil
        <span style="color: #00d3d0;">lsp-signature-auto-activate</span> nil
        <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">lsp-enable-on-type-formatting nil</span>
        <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">lsp-enable-symbol-highlighting nil</span>
        <span style="color: #00d3d0;">lsp-enable-file-watchers</span> nil<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1827c2f" class="outline-4">
<h4 id="org1827c2f"><span class="section-number-4">8.2.7</span> Don&rsquo;t restart on exit</h4>
<div class="outline-text-4" id="text-8-2-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> <span style="color: #00d3d0;">lsp-mode</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">lsp-restart</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">ignore</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org891d68a" class="outline-4">
<h4 id="org891d68a"><span class="section-number-4">8.2.8</span> <span class="todo TODO">TODO</span> Eglot</h4>
<div class="outline-text-4" id="text-8-2-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">when</span> <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">featurep!</span> +eglot<span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> eglot
    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">add-to-list</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">eglot-server-programs</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00cd68;">(</span>python-mode . <span style="color: #b6a0ff;">(</span><span style="color: #79a8ff;">"pyright-langserver"</span> <span style="color: #79a8ff;">"--stdio"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org9998b22" class="outline-3">
<h3 id="org9998b22"><span class="section-number-3">8.3</span> Pytest</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> python-pytest
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> python-pytest-arguments <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"--color"</span> <span style="color: #79a8ff;">"--failed-first"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">evil-set-initial-state</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">python-pytest-mode</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">normal</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"^\\*pytest*"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">right</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.50</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
