readme.html
<div id="outline-container-orgb27d3bc" class="outline-3">
<h3 id="orgb27d3bc"><span class="section-number-3">8.4</span> dap-mode</h3>
<div class="outline-text-3" id="text-8-4">
</div>
<div id="outline-container-orgedeec01" class="outline-4">
<h4 id="orgedeec01"><span class="section-number-4">8.4.1</span> dap configure windows</h4>
<div class="outline-text-4" id="text-8-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> <span style="color: #00d3d0;">dap-mode</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq dap-auto-show-output t)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">dap-output-window-max-height</span> <span style="color: #00bcff;">50</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">dap-output-window-min-height</span> <span style="color: #00bcff;">50</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">dap-auto-configure-features</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span>locals<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">dap-ui-buffer-configurations</span>
        <span style="color: #b6a0ff; font-weight: bold;">`</span><span style="color: #6ae4b9;">(</span><span style="color: #00cd68;">(</span>,<span style="color: #79a8ff;">"*dap-ui-locals*"</span>  . <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span>side . right<span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span>slot . <span style="color: #00bcff;">1</span><span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">window-width</span> . <span style="color: #00bcff;">0.50</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span> <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">changed this to 0.50</span>
          <span style="color: #00cd68;">(</span>,<span style="color: #79a8ff;">"*dap-ui-repl*"</span> . <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span>side . right<span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span>slot . <span style="color: #00bcff;">1</span><span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">window-width</span> . <span style="color: #00bcff;">0.50</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span> <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">added this! </span><span style="color: #feacd0;">TODO</span><span style="color: #a8a8a8; font-style: italic;"> enable when release on MELPA</span>
          <span style="color: #00cd68;">(</span>,<span style="color: #79a8ff;">"*dap-ui-expressions*"</span> . <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span>side . right<span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span>slot . <span style="color: #00bcff;">2</span><span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">window-width</span> . <span style="color: #00bcff;">0.20</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
          <span style="color: #00cd68;">(</span>,<span style="color: #79a8ff;">"*dap-ui-sessions*"</span> . <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span>side . right<span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span>slot . <span style="color: #00bcff;">3</span><span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">window-width</span> . <span style="color: #00bcff;">0.20</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
          <span style="color: #00cd68;">(</span>,<span style="color: #79a8ff;">"*dap-ui-breakpoints*"</span> . <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span>side . left<span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span>slot . <span style="color: #00bcff;">2</span><span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">window-width</span> . , <span style="color: #00bcff;">0.20</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
          <span style="color: #00cd68;">(</span>,<span style="color: #79a8ff;">"*debug-window*"</span> . <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span>side . bottom<span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span>slot . <span style="color: #00bcff;">3</span><span style="color: #6ae4b9;">)</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">window-width</span> . <span style="color: #00bcff;">0.20</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

<span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(set-popup-rule! "^\\*dap-debug-script*" :side 'bottom :size .30)</span>


  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">my/window-visible</span> <span style="color: #6ae4b9;">(</span>b-name<span style="color: #6ae4b9;">)</span>
    <span style="color: #c6eaff; font-style: italic;">"Return whether B-NAME is visible."</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">-&gt;</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">-compose</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">buffer-name</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">window-buffer</span><span style="color: #00cd68;">)</span>
        <span style="color: #00cd68;">(</span><span style="color: #00bcff;">-map</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">window-list</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
        <span style="color: #00cd68;">(</span><span style="color: #00bcff;">-contains?</span> b-name<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">my/show-debug-windows</span> <span style="color: #6ae4b9;">(</span>session<span style="color: #6ae4b9;">)</span>
    <span style="color: #c6eaff; font-style: italic;">"Show debug windows."</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">let</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">(</span><span style="color: #00d3d0;">lsp--cur-workspace</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">dap--debug-session-workspace</span> session<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
      <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">save-excursion</span>
        <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">unless</span> <span style="color: #6ae4b9;">(</span><span style="color: #feacd0;">my/window-visible</span> <span style="color: #00d3d0;">dap-ui--repl-buffer</span><span style="color: #6ae4b9;">)</span>
          <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">dap-ui-repl</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">dap-stopped-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">my/show-debug-windows</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">my/hide-debug-windows</span> <span style="color: #6ae4b9;">(</span>session<span style="color: #6ae4b9;">)</span>
    <span style="color: #c6eaff; font-style: italic;">"Hide debug windows when all debug sessions are dead."</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">unless</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">-filter</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">dap--session-running</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">dap--get-sessions</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
      <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">and</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">get-buffer</span> <span style="color: #00d3d0;">dap-ui--repl-buffer</span><span style="color: #b6a0ff;">)</span>
           <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">kill-buffer</span> <span style="color: #00d3d0;">dap-ui--repl-buffer</span><span style="color: #b6a0ff;">)</span>
           <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">get-buffer</span> <span style="color: #00d3d0;">dap-ui--debug-window-buffer</span><span style="color: #b6a0ff;">)</span>
           <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">kill-buffer</span> <span style="color: #00d3d0;">dap-ui--debug-window-buffer</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">dap-terminated-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">my/hide-debug-windows</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ec5319" class="outline-4">
<h4 id="org3ec5319"><span class="section-number-4">8.4.2</span> Remove dap ui features</h4>
<div class="outline-text-4" id="text-8-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq dap-auto-configure-features '(locals))</span>
<span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(after! dap-mode</span>
<span style="color: #a8a8a8; font-style: italic;">;;   </span><span style="color: #a8a8a8; font-style: italic;">(setq dap-overlays-use-overlays nil)</span>
<span style="color: #a8a8a8; font-style: italic;">;;   </span><span style="color: #a8a8a8; font-style: italic;">)</span>
<span style="color: #00cd68;">(</span><span style="color: #00bcff;">remove-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">dap-mode-hook</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00d3d0;">dap-tooltip-mode</span><span style="color: #00cd68;">)</span>
<span style="color: #00cd68;">(</span><span style="color: #00bcff;">remove-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">dap-ui-mode-hook</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00d3d0;">dap-ui-controls-mode</span><span style="color: #00cd68;">)</span>

</pre>
</div>
</div>
</div>
