config.org
*** Debug templates:
Templates accessible with =, d d=
#+BEGIN_SRC emacs-lisp
(after! dap-python
  (dap-register-debug-template "dap-debug-script"
                               (list :type "python"
                                     :args []
                                     :cwd "${workspaceFolder}"
                                     ;; :cwd (lsp-workspace-root)
                                     ;; :justMyCode :json-false
                                     ;; :debugOptions ["DebugStdLib" "ShowReturnValue" "RedirectOutput"]
                                     ;; :program nil ; (expand-file-name "~/git/blabla")
                                     :request "launch"
                                     ;; :debugger 'ptvsd
                                     :debugger 'debugpy
                                     :name "dap-debug-script"))

  ;; (dap-register-debug-template "Python :: Run pytest (at point), ptvsd"
  ;;                              (list :type "python-test-at-point"
  ;;                                    :args ""
  ;;                                    :module "pytest"
  ;;                                    :request "launch"
  ;;                                    :debugger 'ptvsd
  ;;                                    :name "Python :: Run pytest (at point)"))

  ;; (dap-register-debug-template "Python :: Run pytest (at point), debugpy"
  ;;                              (list :type "python-test-at-point"
  ;;                                    :args ["/Users/luca/git/wondercast/caf/test/customer_allocation/summarize_historical/summarize_historical_test.py::test_summarize"]
  ;;                                    ;; :module "pytest"
  ;;                                    :request "launch"
  ;;                                    :debugger 'debugpy
  ;;                                    :name "Python :: Run pytest (at point)"))

  )
#+END_SRC

*** Debug test at point
Standard debug test target, accessible with =, d t=

For pytest the command is
~python -m ptvsd --wait --host localhost --port 62421 -m pytest /.../summarize_historical_test.py\:\:test_summarize~
#+BEGIN_SRC emacs-lisp
;; (after! dap-python
;;   (require 'python-pytest)

;;   (defun dap-python-test-method-at-point-debugpy ()
;;     (interactive
;;        (dap-debug
;;         (list :type "python"
;;               ;; :args []
;;               ;; :args "py.test /Users/luca/git/wondercast/caf/test/customer_allocation/summarize_historical/summarize_historical_test.py"
;;               :args (concat (buffer-file-name) ":" ":" (python-pytest--current-defun))
;;               ;; :program (concat (buffer-file-name) ":" ":" (python-pytest--current-defun))
;;               ;; :program "/Users/luca/git/wondercast/caf/test/customer_allocation/summarize_historical/summarize_historical_test.py"
;;               ;; :module "pytest"
;;               :debugger 'debugpy
;;               :request "launch"
;;               :name "dap-debug-test-function-debugpy"))))

;;   (defun dap-python-test-method-at-point ()
;;     (interactive
;;        (dap-debug
;;         (list :type "python"
;;               :args ""
;;               ;; :args []
;;               :cwd (lsp-workspace-root)
;;               :program (concat (buffer-file-name) ":" ":" (python-pytest--current-defun))
;;               :module "pytest"
;;               :debugger 'ptvsd
;;               ;; :debugger 'debugpy
;;               :request "launch"
;;               :name "dap-debug-test-function")))))
#+END_SRC

