readme.html

<div id="outline-container-org926f6b9" class="outline-4">
<h4 id="org926f6b9"><span class="section-number-4">8.4.3</span> Debug templates:</h4>
<div class="outline-text-4" id="text-8-4-3">
<p>
Templates accessible with <code>, d d</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> dap-python
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">dap-register-debug-template</span> <span style="color: #79a8ff;">"dap-debug-script"</span>
                               <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">list</span> <span style="color: #f78fe7; font-weight: bold;">:type</span> <span style="color: #79a8ff;">"python"</span>
                                     <span style="color: #f78fe7; font-weight: bold;">:args</span> <span style="color: #00cd68;">[]</span>
                                     <span style="color: #f78fe7; font-weight: bold;">:cwd</span> <span style="color: #79a8ff;">"${workspaceFolder}"</span>
                                     <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">:cwd (lsp-workspace-root)</span>
                                     <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">:justMyCode :json-false</span>
                                     <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">:debugOptions ["DebugStdLib" "ShowReturnValue" "RedirectOutput"]</span>
                                     <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">:program nil ; (expand-file-name "~/git/blabla")</span>
                                     <span style="color: #f78fe7; font-weight: bold;">:request</span> <span style="color: #79a8ff;">"launch"</span>
                                     <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">:debugger 'ptvsd</span>
                                     <span style="color: #f78fe7; font-weight: bold;">:debugger</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">debugpy</span>
                                     <span style="color: #f78fe7; font-weight: bold;">:name</span> <span style="color: #79a8ff;">"dap-debug-script"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(dap-register-debug-template "Python :: Run pytest (at point), ptvsd"</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                              </span><span style="color: #a8a8a8; font-style: italic;">(list :type "python-test-at-point"</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                                    </span><span style="color: #a8a8a8; font-style: italic;">:args ""</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                                    </span><span style="color: #a8a8a8; font-style: italic;">:module "pytest"</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                                    </span><span style="color: #a8a8a8; font-style: italic;">:request "launch"</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                                    </span><span style="color: #a8a8a8; font-style: italic;">:debugger 'ptvsd</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                                    </span><span style="color: #a8a8a8; font-style: italic;">:name "Python :: Run pytest (at point)"))</span>

  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(dap-register-debug-template "Python :: Run pytest (at point), debugpy"</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                              </span><span style="color: #a8a8a8; font-style: italic;">(list :type "python-test-at-point"</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                                    </span><span style="color: #a8a8a8; font-style: italic;">:args ["/Users/luca/git/wondercast/caf/test/customer_allocation/summarize_historical/summarize_historical_test.py::test_summarize"]</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                                    </span><span style="color: #a8a8a8; font-style: italic;">;; :module "pytest"</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                                    </span><span style="color: #a8a8a8; font-style: italic;">:request "launch"</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                                    </span><span style="color: #a8a8a8; font-style: italic;">:debugger 'debugpy</span>
  <span style="color: #a8a8a8; font-style: italic;">;;                                    </span><span style="color: #a8a8a8; font-style: italic;">:name "Python :: Run pytest (at point)"))</span>

  <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org76f378c" class="outline-4">
<h4 id="org76f378c"><span class="section-number-4">8.4.4</span> Debug test at point</h4>
<div class="outline-text-4" id="text-8-4-4">
<p>
Standard debug test target, accessible with <code>, d t</code>
</p>

<p>
For pytest the command is
<code>python -m ptvsd --wait --host localhost --port 62421 -m pytest /.../summarize_historical_test.py\:\:test_summarize</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(after! dap-python</span>
<span style="color: #a8a8a8; font-style: italic;">;;   </span><span style="color: #a8a8a8; font-style: italic;">(require 'python-pytest)</span>

<span style="color: #a8a8a8; font-style: italic;">;;   </span><span style="color: #a8a8a8; font-style: italic;">(defun dap-python-test-method-at-point-debugpy ()</span>
<span style="color: #a8a8a8; font-style: italic;">;;     </span><span style="color: #a8a8a8; font-style: italic;">(interactive</span>
<span style="color: #a8a8a8; font-style: italic;">;;        </span><span style="color: #a8a8a8; font-style: italic;">(dap-debug</span>
<span style="color: #a8a8a8; font-style: italic;">;;         </span><span style="color: #a8a8a8; font-style: italic;">(list :type "python"</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">;; :args []</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">;; :args "py.test /Users/luca/git/wondercast/caf/test/customer_allocation/summarize_historical/summarize_historical_test.py"</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:args (concat (buffer-file-name) ":" ":" (python-pytest--current-defun))</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">;; :program (concat (buffer-file-name) ":" ":" (python-pytest--current-defun))</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">;; :program "/Users/luca/git/wondercast/caf/test/customer_allocation/summarize_historical/summarize_historical_test.py"</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">;; :module "pytest"</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:debugger 'debugpy</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:request "launch"</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:name "dap-debug-test-function-debugpy"))))</span>

<span style="color: #a8a8a8; font-style: italic;">;;   </span><span style="color: #a8a8a8; font-style: italic;">(defun dap-python-test-method-at-point ()</span>
<span style="color: #a8a8a8; font-style: italic;">;;     </span><span style="color: #a8a8a8; font-style: italic;">(interactive</span>
<span style="color: #a8a8a8; font-style: italic;">;;        </span><span style="color: #a8a8a8; font-style: italic;">(dap-debug</span>
<span style="color: #a8a8a8; font-style: italic;">;;         </span><span style="color: #a8a8a8; font-style: italic;">(list :type "python"</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:args ""</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">;; :args []</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:cwd (lsp-workspace-root)</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:program (concat (buffer-file-name) ":" ":" (python-pytest--current-defun))</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:module "pytest"</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:debugger 'ptvsd</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">;; :debugger 'debugpy</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:request "launch"</span>
<span style="color: #a8a8a8; font-style: italic;">;;               </span><span style="color: #a8a8a8; font-style: italic;">:name "dap-debug-test-function")))))</span>
</pre>
</div>
</div>
</div>
