config.org
*** virtualenv executable
#+BEGIN_SRC emacs-lisp
(defadvice! +dap-python-poetry-executable-find-a (orig-fn &rest args)
  "Use the Python binary from the current virtual environment."
  :around #'dap-python--pyenv-executable-find
  (if (getenv "VIRTUAL_ENV")
      (executable-find (car args))
    (apply orig-fn args)))
;; (after! dap-python
;;   (defun dap-python--pyenv-executable-find (command)
;;     (concat (getenv "VIRTUAL_ENV") "/bin/python")))
#+END_SRC
*** Delete hap hydra bindings
#+BEGIN_SRC emacs-lisp
(map! :localleader
        :map +dap-running-session-mode-map
      "d" nil)

;; (map! :after dap-mode
;;     :map dap-mode-map
;;     :localleader "d" nil)
#+END_SRC

*** Bindings
#+BEGIN_SRC emacs-lisp
(map! :after dap-mode
    :map python-mode-map
    :localleader
    ;; "d" nil
    (:desc "debug" :prefix "d"
      :desc "Hydra" :n "h" #'dap-hydra
      :desc "Run debug configuration" :n "d" #'dap-debug
      :desc "dap-ui REPL" :n "r" #'dap-ui-repl
      :desc "Debug test function" :n "t" #'dap-python-debug-test-at-point
      :desc "Run last debug configuration" :n "l" #'dap-debug-last
      :desc "Toggle breakpoint" :n "b" #'dap-breakpoint-toggle
      :desc "dap continue" :n "c" #'dap-continue
      :desc "dap next" :n "n" #'dap-next
      :desc "Debug script" :n "s" #'dap-python-script
      :desc "dap step in" :n "i" #'dap-step-in
      :desc "dap eval at point" :n "e" #'dap-eval-thing-at-point
      :desc "Disconnect" :n "q" #'dap-disconnect ))
#+END_SRC

*** TODO Use debugpy
#+BEGIN_SRC emacs-lisp
(after! dap-mode
  (setq dap-python-debugger 'debugpy))
#+END_SRC

** emacs-ipython-notebook
*** Don't ignore ~ein~ buffers
#+BEGIN_SRC emacs-lisp
(after! ein
  (set-popup-rule! "^\\*ein" :ignore t))
#+END_SRC
