readme.html

<div id="outline-container-org365f42f" class="outline-4">
<h4 id="org365f42f"><span class="section-number-4">8.4.5</span> virtualenv executable</h4>
<div class="outline-text-4" id="text-8-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defadvice!</span> +dap-python-poetry-executable-find-a <span style="color: #b6a0ff;">(</span>orig-fn <span style="color: #f78fe7;">&amp;rest</span> args<span style="color: #b6a0ff;">)</span>
  <span style="color: #c6eaff; font-style: italic;">"Use the Python binary from the current virtual environment."</span>
  <span style="color: #f78fe7; font-weight: bold;">:around</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-python--pyenv-executable-find</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">if</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">getenv</span> <span style="color: #79a8ff;">"VIRTUAL_ENV"</span><span style="color: #6ae4b9;">)</span>
      <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">executable-find</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">car</span> args<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">apply</span> orig-fn args<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
<span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(after! dap-python</span>
<span style="color: #a8a8a8; font-style: italic;">;;   </span><span style="color: #a8a8a8; font-style: italic;">(defun dap-python--pyenv-executable-find (command)</span>
<span style="color: #a8a8a8; font-style: italic;">;;     </span><span style="color: #a8a8a8; font-style: italic;">(concat (getenv "VIRTUAL_ENV") "/bin/python")))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org81679eb" class="outline-4">
<h4 id="org81679eb"><span class="section-number-4">8.4.6</span> Delete hap hydra bindings</h4>
<div class="outline-text-4" id="text-8-4-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:localleader</span>
        <span style="color: #f78fe7; font-weight: bold;">:map</span> <span style="color: #00d3d0;">+dap-running-session-mode-map</span>
      <span style="color: #79a8ff;">"d"</span> nil<span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(map! :after dap-mode</span>
<span style="color: #a8a8a8; font-style: italic;">;;     </span><span style="color: #a8a8a8; font-style: italic;">:map dap-mode-map</span>
<span style="color: #a8a8a8; font-style: italic;">;;     </span><span style="color: #a8a8a8; font-style: italic;">:localleader "d" nil)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9e9f82" class="outline-4">
<h4 id="orgc9e9f82"><span class="section-number-4">8.4.7</span> Bindings</h4>
<div class="outline-text-4" id="text-8-4-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:after</span> <span style="color: #00d3d0;">dap-mode</span>
    <span style="color: #f78fe7; font-weight: bold;">:map</span> <span style="color: #00d3d0;">python-mode-map</span>
    <span style="color: #f78fe7; font-weight: bold;">:localleader</span>
    <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">"d" nil</span>
    <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"debug"</span> <span style="color: #f78fe7; font-weight: bold;">:prefix</span> <span style="color: #79a8ff;">"d"</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Hydra"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"h"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-hydra</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Run debug configuration"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"d"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-debug</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"dap-ui REPL"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"r"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-ui-repl</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Debug test function"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"t"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-python-debug-test-at-point</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Run last debug configuration"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"l"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-debug-last</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Toggle breakpoint"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"b"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-breakpoint-toggle</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"dap continue"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"c"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-continue</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"dap next"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"n"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-next</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Debug script"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"s"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-python-script</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"dap step in"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"i"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-step-in</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"dap eval at point"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"e"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-eval-thing-at-point</span>
      <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Disconnect"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"q"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">dap-disconnect</span> <span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org786d0bd" class="outline-4">
<h4 id="org786d0bd"><span class="section-number-4">8.4.8</span> <span class="todo TODO">TODO</span> Use debugpy</h4>
<div class="outline-text-4" id="text-8-4-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> <span style="color: #00d3d0;">dap-mode</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">dap-python-debugger</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">debugpy</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc4b9b51" class="outline-3">
<h3 id="orgc4b9b51"><span class="section-number-3">8.5</span> emacs-ipython-notebook</h3>
<div class="outline-text-3" id="text-8-5">
</div>
<div id="outline-container-org1b36bee" class="outline-4">
<h4 id="org1b36bee"><span class="section-number-4">8.5.1</span> Don&rsquo;t ignore <code>ein</code> buffers</h4>
<div class="outline-text-4" id="text-8-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> ein
  <span style="color: #b6a0ff;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"^\\*ein"</span> <span style="color: #f78fe7; font-weight: bold;">:ignore</span> t<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
