config.org
*** Bindings
Bindings, inspired by[[https://github.com/millejoh/emacs-ipython-notebook/wiki/Spacemacs-Evil-Bindings][ this]].
#+BEGIN_SRC emacs-lisp
(map! (:when (featurep! :tools ein)
        (:map ein:notebook-mode-map
          :nmvo doom-localleader-key nil ;; remove binding to local-leader

          ;; :desc "Execute" :ni "S-RET" #'ein:worksheet-execute-cell

          :localleader
          :desc "Show Hydra" :n "?" #'+ein/hydra/body
          :desc "Execute and step" :n "RET" #'ein:worksheet-execute-cell-and-goto-next
          :desc "Yank cell" :n "y" #'ein:worksheet-copy-cell
          :desc "Paste cell" :n "p" #'ein:worksheet-yank-cell
          :desc "Delete cell" :n "d" #'ein:worksheet-kill-cell
          :desc "Insert cell below" :n "o" #'ein:worksheet-insert-cell-below
          :desc "Insert cell above" :n "O" #'ein:worksheet-insert-cell-above
          :desc "Next cell" :n "j" #'ein:worksheet-goto-next-input
          :desc "Previous cell" :n "k" #'ein:worksheet-goto-prev-input
          :desc "Save notebook" :n "fs" #'ein:notebook-save-notebook-command
      )))
#+END_SRC
** Dash docsets
When ~SPC c k~ fails, try searching in the docsets with ~SPC s k~.
Install docsets with ~dash-docs-install-docset~.
#+BEGIN_SRC emacs-lisp
(set-popup-rule! "*eww*" :side 'right :size .50 :select t :vslot 2 :ttl 3)

(after! dash-docs
  ;; (setq dash-docs-docsets-path "/Users/luca/Library/Application Support/Dash/DocSets")
  ;; (setq counsel-dash-docsets-path "/Users/luca/Library/Application Support/Dash/DocSets")
  ;; (expand-file-name "~/Library/Application Support/Dash/DocSets")
  ;; (set-docsets! 'python-mode "NumPy" "Pandas" "scikit-learn"))
  (setq counsel-dash-docsets '("Pandas" "scikit-learn"))
  (setq dash-docs-docsets '("Pandas" "scikit-learn")))
#+END_SRC
** Compilation popup
#+BEGIN_SRC emacs-lisp
(set-popup-rule! "*compilation*" :side 'right :size .50 :select t :vslot 2 :quit 'current)
#+END_SRC
** Disable venv in modeline
#+BEGIN_SRC emacs-lisp
(after! pyvenv
  (setq pyvenv-mode-line-indicator nil))
#+END_SRC

* R
** ESS console popup
Disable popup for ESS:
#+BEGIN_SRC emacs-lisp
(set-popup-rule! "^\\*R:" :ignore t)
#+END_SRC
** Async eval
#+BEGIN_SRC emacs-lisp
(after! ess
  (setq ess-eval-visibly 'nowait))
#+END_SRC
