readme.html
<div id="outline-container-org0115fc1" class="outline-4">
<h4 id="org0115fc1"><span class="section-number-4">8.5.2</span> Bindings</h4>
<div class="outline-text-4" id="text-8-5-2">
<p>
Bindings, inspired by<a href="https://github.com/millejoh/emacs-ipython-notebook/wiki/Spacemacs-Evil-Bindings"> this</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7; font-weight: bold;">:when</span> <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">featurep!</span> <span style="color: #f78fe7; font-weight: bold;">:tools</span> ein<span style="color: #6ae4b9;">)</span>
        <span style="color: #6ae4b9;">(</span><span style="color: #f78fe7; font-weight: bold;">:map</span> ein:notebook-mode-map
          <span style="color: #f78fe7; font-weight: bold;">:nmvo</span> <span style="color: #00d3d0;">doom-localleader-key</span> nil <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">remove binding to local-leader</span>

          <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">:desc "Execute" :ni "S-RET" #'ein:worksheet-execute-cell</span>

          <span style="color: #f78fe7; font-weight: bold;">:localleader</span>
          <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Show Hydra"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"?"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">+ein/hydra/body</span>
          <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Execute and step"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"RET"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">ein:worksheet-execute-cell-and-goto-next</span>
          <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Yank cell"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"y"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">ein:worksheet-copy-cell</span>
          <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Paste cell"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"p"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">ein:worksheet-yank-cell</span>
          <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Delete cell"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"d"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">ein:worksheet-kill-cell</span>
          <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Insert cell below"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"o"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">ein:worksheet-insert-cell-below</span>
          <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Insert cell above"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"O"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">ein:worksheet-insert-cell-above</span>
          <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Next cell"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"j"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">ein:worksheet-goto-next-input</span>
          <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Previous cell"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"k"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">ein:worksheet-goto-prev-input</span>
          <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Save notebook"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"fs"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">ein:notebook-save-notebook-command</span>
      <span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcec3a14" class="outline-3">
<h3 id="orgcec3a14"><span class="section-number-3">8.6</span> Dash docsets</h3>
<div class="outline-text-3" id="text-8-6">
<p>
When <code>SPC c k</code> fails, try searching in the docsets with <code>SPC s k</code>.
Install docsets with <code>dash-docs-install-docset</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"*eww*"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">right</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.50</span> <span style="color: #f78fe7; font-weight: bold;">:select</span> t <span style="color: #f78fe7; font-weight: bold;">:vslot</span> <span style="color: #00bcff;">2</span> <span style="color: #f78fe7; font-weight: bold;">:ttl</span> <span style="color: #00bcff;">3</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> dash-docs
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq dash-docs-docsets-path "/Users/luca/Library/Application Support/Dash/DocSets")</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq counsel-dash-docsets-path "/Users/luca/Library/Application Support/Dash/DocSets")</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(expand-file-name "~/Library/Application Support/Dash/DocSets")</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(set-docsets! 'python-mode "NumPy" "Pandas" "scikit-learn"))</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> counsel-dash-docsets <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"Pandas"</span> <span style="color: #79a8ff;">"scikit-learn"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">dash-docs-docsets</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #79a8ff;">"Pandas"</span> <span style="color: #79a8ff;">"scikit-learn"</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org80a2eea" class="outline-3">
<h3 id="org80a2eea"><span class="section-number-3">8.7</span> Compilation popup</h3>
<div class="outline-text-3" id="text-8-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"*compilation*"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">right</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.50</span> <span style="color: #f78fe7; font-weight: bold;">:select</span> t <span style="color: #f78fe7; font-weight: bold;">:vslot</span> <span style="color: #00bcff;">2</span> <span style="color: #f78fe7; font-weight: bold;">:quit</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">current</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7d1566d" class="outline-3">
<h3 id="org7d1566d"><span class="section-number-3">8.8</span> Disable venv in modeline</h3>
<div class="outline-text-3" id="text-8-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> pyvenv
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> pyvenv-mode-line-indicator nil<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org25ea4dd" class="outline-2">
<h2 id="org25ea4dd"><span class="section-number-2">9</span> R</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgdd81e77" class="outline-3">
<h3 id="orgdd81e77"><span class="section-number-3">9.1</span> ESS console popup</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Disable popup for ESS:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"^\\*R:"</span> <span style="color: #f78fe7; font-weight: bold;">:ignore</span> t<span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfb1096c" class="outline-3">
<h3 id="orgfb1096c"><span class="section-number-3">9.2</span> Async eval</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> ess
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> ess-eval-visibly <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">nowait</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
