readme.html
<div id="outline-container-org158ea20" class="outline-3">
<h3 id="org158ea20"><span class="section-number-3">9.3</span> Syntax highlighting</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> ess
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> ess-R-font-lock-keywords <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #6ae4b9;">(</span><span style="color: #00cd68;">(</span>ess-R-fl-keyword:keywords . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-R-fl-keyword:constants . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-R-fl-keyword:modifiers . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-R-fl-keyword:fun-defs . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-R-fl-keyword:assign-ops . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-R-fl-keyword:%op% . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-fl-keyword:fun-calls . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-fl-keyword:numbers . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-fl-keyword:operators . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-fl-keyword:delimiters . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-fl-keyword:= . t<span style="color: #00cd68;">)</span>
                                   <span style="color: #00cd68;">(</span>ess-R-fl-keyword:F&amp;T . t<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcba9ac6" class="outline-2">
<h2 id="orgcba9ac6"><span class="section-number-2">10</span> Clojure</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org6889a80" class="outline-3">
<h3 id="org6889a80"><span class="section-number-3">10.1</span> Company keybindings</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> cider
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">company-completion-started-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">custom/set-company-maps</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">company-completion-finished-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">custom/unset-company-maps</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">company-completion-cancelled-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">custom/unset-company-maps</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">custom/unset-company-maps</span> <span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">&amp;rest</span> unused<span style="color: #6ae4b9;">)</span>
    <span style="color: #c6eaff; font-style: italic;">"Set default mappings (outside of company).</span>
<span style="color: #c6eaff; font-style: italic;">    Arguments (UNUSED) are ignored."</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">general-def</span>
      <span style="color: #f78fe7; font-weight: bold;">:states</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">insert</span>
      <span style="color: #f78fe7; font-weight: bold;">:keymaps</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">override</span>
      <span style="color: #79a8ff;">"&lt;down&gt;"</span> nil
      <span style="color: #79a8ff;">"&lt;up&gt;"</span>   nil
      <span style="color: #79a8ff;">"RET"</span>    nil
      <span style="color: #00cd68;">[</span>return<span style="color: #00cd68;">]</span> nil
      <span style="color: #79a8ff;">"C-n"</span>    nil
      <span style="color: #79a8ff;">"C-p"</span>    nil
      <span style="color: #79a8ff;">"C-j"</span>    nil
      <span style="color: #79a8ff;">"C-k"</span>    nil
      <span style="color: #79a8ff;">"C-h"</span>    nil
      <span style="color: #79a8ff;">"C-u"</span>    nil
      <span style="color: #79a8ff;">"C-d"</span>    nil
      <span style="color: #79a8ff;">"C-s"</span>    nil
      <span style="color: #79a8ff;">"C-S-s"</span>   <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">cond</span> <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">featurep!</span> <span style="color: #f78fe7; font-weight: bold;">:completion</span> helm<span style="color: #6ae4b9;">)</span> nil<span style="color: #b6a0ff;">)</span>
                      <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">featurep!</span> <span style="color: #f78fe7; font-weight: bold;">:completion</span> ivy<span style="color: #6ae4b9;">)</span>  nil<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
      <span style="color: #79a8ff;">"C-SPC"</span>   nil
      <span style="color: #79a8ff;">"TAB"</span>     nil
      <span style="color: #00cd68;">[</span>tab<span style="color: #00cd68;">]</span>     nil
      <span style="color: #00cd68;">[</span>backtab<span style="color: #00cd68;">]</span> nil<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">custom/set-company-maps</span> <span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">&amp;rest</span> unused<span style="color: #6ae4b9;">)</span>
    <span style="color: #c6eaff; font-style: italic;">"Set maps for when you're inside company completion.</span>
<span style="color: #c6eaff; font-style: italic;">    Arguments (UNUSED) are ignored."</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">general-def</span>
      <span style="color: #f78fe7; font-weight: bold;">:states</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">insert</span>
      <span style="color: #f78fe7; font-weight: bold;">:keymaps</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">override</span>
      <span style="color: #79a8ff;">"&lt;down&gt;"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-select-next</span>
      <span style="color: #79a8ff;">"&lt;up&gt;"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-select-previous</span>
      <span style="color: #79a8ff;">"RET"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-complete</span>
      <span style="color: #00cd68;">[</span>return<span style="color: #00cd68;">]</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-complete</span>
      <span style="color: #79a8ff;">"C-w"</span>     nil           <span style="color: #a8a8a8; font-style: italic;">; </span><span style="color: #a8a8a8; font-style: italic;">don't interfere with `</span><span style="color: #00bcff; font-style: italic;">evil-delete-backward-word</span><span style="color: #a8a8a8; font-style: italic;">'</span>
      <span style="color: #79a8ff;">"C-n"</span>     <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-select-next</span>
      <span style="color: #79a8ff;">"C-p"</span>     <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-select-previous</span>
      <span style="color: #79a8ff;">"C-j"</span>     <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-select-next</span>
      <span style="color: #79a8ff;">"C-k"</span>     <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-select-previous</span>
      <span style="color: #79a8ff;">"C-h"</span>     <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-show-doc-buffer</span>
      <span style="color: #79a8ff;">"C-u"</span>     <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-previous-page</span>
      <span style="color: #79a8ff;">"C-d"</span>     <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-next-page</span>
      <span style="color: #79a8ff;">"C-s"</span>     <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-filter-candidates</span>
      <span style="color: #79a8ff;">"C-S-s"</span>   <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">cond</span> <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">featurep!</span> <span style="color: #f78fe7; font-weight: bold;">:completion</span> helm<span style="color: #6ae4b9;">)</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">helm-company</span><span style="color: #b6a0ff;">)</span>
                      <span style="color: #b6a0ff;">(</span><span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">featurep!</span> <span style="color: #f78fe7; font-weight: bold;">:completion</span> ivy<span style="color: #6ae4b9;">)</span>  <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">counsel-company</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
      <span style="color: #79a8ff;">"C-SPC"</span>   <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-complete-common</span>
      <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">"TAB"     #'company-complete-common-or-cycle</span>
      <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">[tab]     #'company-complete-common-or-cycle</span>
      <span style="color: #00cd68;">[</span>backtab<span style="color: #00cd68;">]</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">company-select-previous</span>    <span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org047fd3e" class="outline-3">
<h3 id="org047fd3e"><span class="section-number-3">10.2</span> REPL keybindings</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">add-hook!</span> cider-repl-mode <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">evil-normalize-keymaps</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
