config.org
** Cleverparens
#+BEGIN_SRC emacs-lisp
(use-package! evil-cleverparens
  :defer t
  :after smartparens
  :init
  (setq evil-move-beyond-eol t
        evil-cleverparens-use-additional-bindings nil
        evil-cleverparens-use-s-and-S nil
        ;; evil-cleverparens-swap-move-by-word-and-symbol t
        ;; evil-cleverparens-use-regular-insert t
        )
  :config
  (add-hook! clojure-mode #'evil-cleverparens-mode)
  ;; (add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)
  )
#+END_SRC
** Aggressive indent
#+BEGIN_SRC emacs-lisp
(use-package! aggressive-indent
  :after clojure-mode
  :defer t
  :config (add-hook! clojure-mode (aggressive-indent-mode 1)))
#+END_SRC
** Cleverparens keybindings
With ~lispyville~ you can wrap using =M-(= for example!
#+BEGIN_SRC emacs-lisp
(map! :after evil-cleverparens
      :map clojure-mode-map
      :localleader
      (:desc "Wrap round" :n "(" #'sp-wrap-round
       :desc "Wrap square" :n "[" #'sp-wrap-square
       :desc "Wrap curly" :n "{" #'sp-wrap-curly
       :desc "Unwrap sexp" :n "u" #'sp-unwrap-sexp
       ))
#+END_SRC
** nREPL timeout
#+BEGIN_SRC emacs-lisp
(after! cider
 (setq nrepl-sync-request-timeout nil))
#+END_SRC
** Align vertically automatically
#+BEGIN_SRC emacs-lisp
(after! clojure-mode
  (setq clojure-align-forms-automatically t))
#+END_SRC

** Cider keybindings
Remember you can use =gr af= to evaluate the outer form.
=ap= is a paragraph, =as= is a sentence.
#+BEGIN_SRC emacs-lisp
(map! :after cider
      :map clojure-mode-map
      :localleader
      (:desc "eval" :prefix "e"
       :desc "sexp in comment" :n "E" #'cider-pprint-eval-last-sexp-to-comment
       :desc "defun in comment" :n "D" #'cider-pprint-eval-defun-to-comment
       ))
#+END_SRC
** TODO evil lisp state
#+BEGIN_SRC emacs-lisp :tangle no
(use-package! evil-lisp-state
  :defer t
  :custom
  (evil-lisp-state-global t)
  :config (evil-lisp-state-leader "SPC k"))
#+END_SRC
