readme.html

<div id="outline-container-orge926ee9" class="outline-3">
<h3 id="orge926ee9"><span class="section-number-3">10.3</span> Cleverparens</h3>
<div class="outline-text-3" id="text-10-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package!</span> evil-cleverparens
  <span style="color: #f78fe7; font-weight: bold;">:defer</span> t
  <span style="color: #f78fe7; font-weight: bold;">:after</span> smartparens
  <span style="color: #f78fe7; font-weight: bold;">:init</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">evil-move-beyond-eol</span> t
        evil-cleverparens-use-additional-bindings nil
        evil-cleverparens-use-s-and-S nil
        <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">evil-cleverparens-swap-move-by-word-and-symbol t</span>
        <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">evil-cleverparens-use-regular-insert t</span>
        <span style="color: #b6a0ff;">)</span>
  <span style="color: #f78fe7; font-weight: bold;">:config</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">add-hook!</span> clojure-mode <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">evil-cleverparens-mode</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(add-hook 'smartparens-enabled-hook #'evil-smartparens-mode)</span>
  <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgceb926e" class="outline-3">
<h3 id="orgceb926e"><span class="section-number-3">10.4</span> Aggressive indent</h3>
<div class="outline-text-3" id="text-10-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package!</span> aggressive-indent
  <span style="color: #f78fe7; font-weight: bold;">:after</span> clojure-mode
  <span style="color: #f78fe7; font-weight: bold;">:defer</span> t
  <span style="color: #f78fe7; font-weight: bold;">:config</span> <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">add-hook!</span> clojure-mode <span style="color: #6ae4b9;">(</span><span style="color: #feacd0;">aggressive-indent-mode</span> <span style="color: #00bcff;">1</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org13d2ff0" class="outline-3">
<h3 id="org13d2ff0"><span class="section-number-3">10.5</span> Cleverparens keybindings</h3>
<div class="outline-text-3" id="text-10-5">
<p>
With <code>lispyville</code> you can wrap using <code>M-(</code> for example!
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:after</span> evil-cleverparens
      <span style="color: #f78fe7; font-weight: bold;">:map</span> <span style="color: #00d3d0;">clojure-mode-map</span>
      <span style="color: #f78fe7; font-weight: bold;">:localleader</span>
      <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Wrap round"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"("</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">sp-wrap-round</span>
       <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Wrap square"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"["</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">sp-wrap-square</span>
       <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Wrap curly"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"{"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">sp-wrap-curly</span>
       <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Unwrap sexp"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"u"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">sp-unwrap-sexp</span>
       <span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9f5fffa" class="outline-3">
<h3 id="org9f5fffa"><span class="section-number-3">10.6</span> nREPL timeout</h3>
<div class="outline-text-3" id="text-10-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> cider
 <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">nrepl-sync-request-timeout</span> nil<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6edc9f2" class="outline-3">
<h3 id="org6edc9f2"><span class="section-number-3">10.7</span> Align vertically automatically</h3>
<div class="outline-text-3" id="text-10-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> clojure-mode
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">clojure-align-forms-automatically</span> t<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0b5c9b" class="outline-3">
<h3 id="orgf0b5c9b"><span class="section-number-3">10.8</span> Cider keybindings</h3>
<div class="outline-text-3" id="text-10-8">
<p>
Remember you can use <code>gr af</code> to evaluate the outer form.
<code>ap</code> is a paragraph, <code>as</code> is a sentence.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:after</span> cider
      <span style="color: #f78fe7; font-weight: bold;">:map</span> <span style="color: #00d3d0;">clojure-mode-map</span>
      <span style="color: #f78fe7; font-weight: bold;">:localleader</span>
      <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"eval"</span> <span style="color: #f78fe7; font-weight: bold;">:prefix</span> <span style="color: #79a8ff;">"e"</span>
       <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"sexp in comment"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"E"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">cider-pprint-eval-last-sexp-to-comment</span>
       <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"defun in comment"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"D"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">cider-pprint-eval-defun-to-comment</span>
       <span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org026ae78" class="outline-3">
<h3 id="org026ae78"><span class="section-number-3">10.9</span> <span class="todo TODO">TODO</span> evil lisp state</h3>
<div class="outline-text-3" id="text-10-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package!</span> evil-lisp-state
  <span style="color: #f78fe7; font-weight: bold;">:defer</span> t
  <span style="color: #f78fe7; font-weight: bold;">:custom</span>
  <span style="color: #b6a0ff;">(</span>evil-lisp-state-global t<span style="color: #b6a0ff;">)</span>
  <span style="color: #f78fe7; font-weight: bold;">:config</span> <span style="color: #b6a0ff;">(</span>evil-lisp-state-leader <span style="color: #79a8ff;">"SPC k"</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
