config.org
** TODO Miracle
#+BEGIN_SRC emacs-lisp :tangle no
(require 'miracle)

(defun disable-cider-enable-miracle ()
  "Activate miracle for arcadia development"
  (interactive)
  (setq cider-mode nil)
  (cider-mode -1)
  (add-hook 'clojure-mode-hook 'clojure-enable-miracle)
  (add-to-list 'company-backends 'company-miracle)
  ;; (miracle)
  )

(after! miracle
  (defun miracle-eval-string (s callback)
    (miracle-send-eval-string
     s
     (lambda (response)
       (miracle-dbind-response response (id value status)
                               (when (member "done" status)
                                 (remhash id miracle-requests))
                               (when value
                                 (funcall callback nil value))))))
  (defun miracle-get-completions (word callback)
    (interactive)
    (miracle-eval-string
     (format "(do (require '[%s]) (%s/completions \"%s\"))"
             "complete.core" "complete.core" word)
     (lambda (err s)
       (progn
         ;; XXX
         (message (format "received str: %s" s))
         (message (format "err: %s" err))
         (when (not err)
           (funcall callback (read-from-whole-string s)))))))

  (defun company-miracle (command &optional arg &rest ignored)
    (interactive (list 'interactive))
    (cl-case command
      (interactive (company-begin-backend 'company-miracle))
      (prefix (and (or ;;(eq major-mode 'clojurec-mode)
                    ;;(eq major-mode 'clojure-mode)
                    (eq major-mode 'miracle-mode))
                   (get-buffer "*miracle-connection*")
                   (substring-no-properties (company-grab-symbol))))
      (candidates (lexical-let ((arg (substring-no-properties arg)))
                    (cons :async (lambda (callback)
                                   (miracle-get-completions arg callback)))))))

  )

  (map! :after miracle
        :map miracle-interaction-mode-map

        :localleader
        (:desc "eval" :prefix "e"
         :desc "Expression" :n "e" #'miracle-eval-expression-at-point
         :desc "defun" :n "d" #'miracle-eval-defun)
        :desc "describe" :n "?" #'miracle-describe
        )

(set-popup-rule! "*miracle*" :side 'bottom :size .40)
#+END_SRC
** cider-doc while developing Unity
#+BEGIN_SRC emacs-lisp
(after! cider
  (set-lookup-handlers! 'clojure-mode
    :documentation #'cider-doc))
#+END_SRC

* Shell
