readme.html
<div id="outline-container-org51e5189" class="outline-3">
<h3 id="org51e5189"><span class="section-number-3">10.10</span> <span class="todo TODO">TODO</span> Miracle</h3>
<div class="outline-text-3" id="text-10-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #00bcff;">require</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">miracle</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">disable-cider-enable-miracle</span> <span style="color: #b6a0ff;">()</span>
  <span style="color: #c6eaff; font-style: italic;">"Activate miracle for arcadia development"</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> <span style="color: #00d3d0;">cider-mode</span> nil<span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00d3d0;">cider-mode</span> <span style="color: #00bcff;">-1</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">clojure-mode-hook</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">clojure-enable-miracle</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">add-to-list</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00d3d0;">company-backends</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">company-miracle</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(miracle)</span>
  <span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> miracle
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">miracle-eval-string</span> <span style="color: #6ae4b9;">(</span>s callback<span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span>miracle-send-eval-string
     s
     <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">lambda</span> <span style="color: #b6a0ff;">(</span>response<span style="color: #b6a0ff;">)</span>
       <span style="color: #b6a0ff;">(</span>miracle-dbind-response response <span style="color: #6ae4b9;">(</span>id value status<span style="color: #6ae4b9;">)</span>
                               <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">when</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">member</span> <span style="color: #79a8ff;">"done"</span> status<span style="color: #00cd68;">)</span>
                                 <span style="color: #00cd68;">(</span><span style="color: #00bcff;">remhash</span> id miracle-requests<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
                               <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">when</span> value
                                 <span style="color: #00cd68;">(</span><span style="color: #00bcff;">funcall</span> callback nil value<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">miracle-get-completions</span> <span style="color: #6ae4b9;">(</span>word callback<span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span>miracle-eval-string
     <span style="color: #00cd68;">(</span><span style="color: #00bcff;">format</span> <span style="color: #79a8ff;">"(do (require '[%s]) (%s/completions \"%s\"))"</span>
             <span style="color: #79a8ff;">"complete.core"</span> <span style="color: #79a8ff;">"complete.core"</span> word<span style="color: #00cd68;">)</span>
     <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">lambda</span> <span style="color: #b6a0ff;">(</span>err s<span style="color: #b6a0ff;">)</span>
       <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">progn</span>
         <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #f4923b;">XXX</span>
         <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">message</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">format</span> <span style="color: #79a8ff;">"received str: %s"</span> s<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
         <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">message</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">format</span> <span style="color: #79a8ff;">"err: %s"</span> err<span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
         <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">when</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">not</span> err<span style="color: #00cd68;">)</span>
           <span style="color: #00cd68;">(</span><span style="color: #00bcff;">funcall</span> callback <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">read-from-whole-string</span> s<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">company-miracle</span> <span style="color: #6ae4b9;">(</span>command <span style="color: #f78fe7;">&amp;optional</span> arg <span style="color: #f78fe7;">&amp;rest</span> ignored<span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">list</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">interactive</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
    <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">cl-case</span> command
      <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">interactive</span> <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">company-begin-backend</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">company-miracle</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
      <span style="color: #00cd68;">(</span>prefix <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">and</span> <span style="color: #6ae4b9;">(</span><span style="color: #b6a0ff; font-weight: bold;">or</span> <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">(eq major-mode 'clojurec-mode)</span>
                    <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">(eq major-mode 'clojure-mode)</span>
                    <span style="color: #00cd68;">(</span><span style="color: #00bcff;">eq</span> <span style="color: #00d3d0;">major-mode</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">miracle-mode</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
                   <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">get-buffer</span> <span style="color: #79a8ff;">"*miracle-connection*"</span><span style="color: #6ae4b9;">)</span>
                   <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">substring-no-properties</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">company-grab-symbol</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
      <span style="color: #00cd68;">(</span>candidates <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">lexical-let</span> <span style="color: #6ae4b9;">(</span><span style="color: #00cd68;">(</span>arg <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">substring-no-properties</span> arg<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
                    <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">cons</span> <span style="color: #f78fe7; font-weight: bold;">:async</span> <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">lambda</span> <span style="color: #b6a0ff;">(</span>callback<span style="color: #b6a0ff;">)</span>
                                   <span style="color: #b6a0ff;">(</span>miracle-get-completions arg callback<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>

  <span style="color: #00cd68;">)</span>

  <span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">map!</span> <span style="color: #f78fe7; font-weight: bold;">:after</span> miracle
        <span style="color: #f78fe7; font-weight: bold;">:map</span> miracle-interaction-mode-map

        <span style="color: #f78fe7; font-weight: bold;">:localleader</span>
        <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"eval"</span> <span style="color: #f78fe7; font-weight: bold;">:prefix</span> <span style="color: #79a8ff;">"e"</span>
         <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"Expression"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"e"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">miracle-eval-expression-at-point</span>
         <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"defun"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"d"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">miracle-eval-defun</span><span style="color: #b6a0ff;">)</span>
        <span style="color: #f78fe7; font-weight: bold;">:desc</span> <span style="color: #79a8ff;">"describe"</span> <span style="color: #f78fe7; font-weight: bold;">:n</span> <span style="color: #79a8ff;">"?"</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">miracle-describe</span>
        <span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"*miracle*"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">bottom</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.40</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgedca8df" class="outline-3">
<h3 id="orgedca8df"><span class="section-number-3">10.11</span> cider-doc while developing Unity</h3>
<div class="outline-text-3" id="text-10-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">after!</span> cider
  <span style="color: #b6a0ff;">(</span><span style="color: #feacd0;">set-lookup-handlers!</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">clojure-mode</span>
    <span style="color: #f78fe7; font-weight: bold;">:documentation</span> <span style="color: #b6a0ff; font-weight: bold;">#'</span><span style="color: #00bcff;">cider-doc</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>
