config.org
** Async Shell command
#+BEGIN_SRC emacs-lisp
(defun shell-command-print-separator ()
  (overlay-put (make-overlay (point-max) (point-max))
               'before-string
               (propertize "!" 'display
                           (list 'left-fringe
                                 'right-triangle))))

(advice-add 'shell-command--save-pos-or-erase :after 'shell-command-print-separator)
#+END_SRC
** Async command and vterm popups
#+BEGIN_SRC emacs-lisp
  (set-popup-rule! "*Async Shell Command*" :side 'bottom :size .40)
  (set-popup-rule! "vterm" :side 'right :size .40 :quit 'current :ttl 3)
#+END_SRC
** Eshell popup to the right
#+BEGIN_SRC emacs-lisp
(set-popup-rule! "*eshell*" :side 'right :size .50)
#+END_SRC

* TODO Webkit
#+BEGIN_SRC emacs-lisp :tangle no
(use-package webkit
  :bind ("s-b" 'webkit) ;; Bind to whatever global key binding you want if you want
  :init
  (setq webkit-search-prefix "https://google.com/search?q=") ;; If you don't care so much about privacy
  (setq webkit-ace-chars "aoeuidhtns") ;; More convienent if you use dvorak
  ;; (setq webkit-history-filename "~/path/to/webkit-history") ;; If you want history saved in a different place
  ;; (setq webkit-history-filename nil) ;; If you don't want history saved to file (will stay in memory)
  ;; (setq webkit-own-window t) ;; See above explination; must be set before webkit.el is loaded
  ;; (setq browse-url-browser-function 'webkit-browse-url) ; Set as the default browse-url browser
  ;; (setq webkit-browse-url-force-new t) ; Always open a new session instead of reusing a current one
  :config
  ;; (add-hook 'webkit-new-hook #'webkit-enable-javascript) ;; disable javascript
  )

(use-package evil-collection-webkit
  :config
  (evil-collection-xwidget-setup)
  )
#+END_SRC
