readme.html

<div id="outline-container-orgc8bd17f" class="outline-2">
<h2 id="orgc8bd17f"><span class="section-number-2">11</span> Shell</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgb5b304a" class="outline-3">
<h3 id="orgb5b304a"><span class="section-number-3">11.1</span> Async Shell command</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">defun</span> <span style="color: #feacd0;">shell-command-print-separator</span> <span style="color: #b6a0ff;">()</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">overlay-put</span> <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">make-overlay</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">point-max</span><span style="color: #00cd68;">)</span> <span style="color: #00cd68;">(</span><span style="color: #00bcff;">point-max</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span>
               <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">before-string</span>
               <span style="color: #6ae4b9;">(</span><span style="color: #00bcff;">propertize</span> <span style="color: #79a8ff;">"!"</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">display</span>
                           <span style="color: #00cd68;">(</span><span style="color: #00bcff;">list</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">left-fringe</span>
                                 <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">right-triangle</span><span style="color: #00cd68;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #00bcff;">advice-add</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">shell-command--save-pos-or-erase</span> <span style="color: #f78fe7; font-weight: bold;">:after</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">shell-command-print-separator</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd43c83" class="outline-3">
<h3 id="orgdd43c83"><span class="section-number-3">11.2</span> Async command and vterm popups</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"*Async Shell Command*"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">bottom</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.40</span><span style="color: #00cd68;">)</span>
  <span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"vterm"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">right</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.40</span> <span style="color: #f78fe7; font-weight: bold;">:quit</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">current</span> <span style="color: #f78fe7; font-weight: bold;">:ttl</span> <span style="color: #00bcff;">3</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8d7e8a8" class="outline-3">
<h3 id="org8d7e8a8"><span class="section-number-3">11.3</span> Eshell popup to the right</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #feacd0;">set-popup-rule!</span> <span style="color: #79a8ff;">"*eshell*"</span> <span style="color: #f78fe7; font-weight: bold;">:side</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">right</span> <span style="color: #f78fe7; font-weight: bold;">:size</span> <span style="color: #00bcff;">.50</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org16a454d" class="outline-2">
<h2 id="org16a454d"><span class="section-number-2">12</span> <span class="todo TODO">TODO</span> Webkit</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package</span> webkit
  <span style="color: #f78fe7; font-weight: bold;">:bind</span> <span style="color: #b6a0ff;">(</span><span style="color: #79a8ff;">"s-b"</span> <span style="color: #b6a0ff; font-weight: bold;">'</span><span style="color: #00bcff;">webkit</span><span style="color: #b6a0ff;">)</span> <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Bind to whatever global key binding you want if you want</span>
  <span style="color: #f78fe7; font-weight: bold;">:init</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> webkit-search-prefix <span style="color: #79a8ff;">"https://google.com/search?q="</span><span style="color: #b6a0ff;">)</span> <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">If you don't care so much about privacy</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff; font-weight: bold;">setq</span> webkit-ace-chars <span style="color: #79a8ff;">"aoeuidhtns"</span><span style="color: #b6a0ff;">)</span> <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">More convienent if you use dvorak</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq webkit-history-filename "~/path/to/webkit-history") ;; If you want history saved in a different place</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq webkit-history-filename nil) ;; If you don't want history saved to file (will stay in memory)</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq webkit-own-window t) ;; See above explination; must be set before webkit.el is loaded</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq browse-url-browser-function 'webkit-browse-url) ; Set as the default browse-url browser</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(setq webkit-browse-url-force-new t) ; Always open a new session instead of reusing a current one</span>
  <span style="color: #f78fe7; font-weight: bold;">:config</span>
  <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">(add-hook 'webkit-new-hook #'webkit-enable-javascript) ;; disable javascript</span>
  <span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff; font-weight: bold;">use-package</span> evil-collection-webkit
  <span style="color: #f78fe7; font-weight: bold;">:config</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #feacd0;">evil-collection-xwidget-setup</span><span style="color: #b6a0ff;">)</span>
  <span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luca Cambiaghi</p>
<p class="date">Created: 2020-12-09 Wed 22:29</p>
</div>
</body>
</html>
